[{"index": "53908bde20f70186a0dc732a", "title": "Virtual Flythrough over a Voxel-Based Terrain", "abstract": "A voxel-based terrain visualization system is presented with real-time performance on general-purpose graphics multiprocessor workstations. Ray casting of antialiased 3D volum/Users/wangyong/Research_in_IBM/scholar-profile-vis/data/processing_code/researcher_text/Jeffrey Heer.jsone terrain and subvoxel sampling in true 3D space produce high quality images. Based on this rendering algorithm, an interactive flythrough system for mission planning and flight simulation has been developed on an SGI Power Challenge and a virtual reality environment using a Responsive Workbench. Arbitrary stereoscopic perspective views over the terrain and a 6D input device are supported.", "year": "1999", "venue": "VR '99 Proceedings of the IEEE Virtual Reality", "citations": ["5390a96f20f70186a0ea3f94", "5390b00c20f70186a0ed624a", "5390b52620f70186a0f039d9", "5390b86b20f70186a0f28138", "5390881220f70186a0d7e182", "53908bde20f70186a0dc7384", "5390958a20f70186a0defce2"], "references": [], "authors": ["Ming Wan", "Huamin Qu", "Arie Kaufman"], "_id": {"$oid": "5797a583c60b4bede9eaa8b5"}}, {"index": "53908bde20f70186a0dc732a", "title": "Virtual Flythrough over a Voxel-Based Terrain", "abstract": "A voxel-based terrain visualization system is presented with real-time performance on general-purpose graphics multiprocessor workstations. Ray casting of antialiased 3D volume terrain and subvoxel sampling in true 3D space produce high quality images. Based on this rendering algorithm, an interactive flythrough system for mission planning and flight simulation has been developed on an SGI Power Challenge and a virtual reality environment using a Responsive Workbench. Arbitrary stereoscopic perspective views over the terrain and a 6D input device are supported.", "year": "1999", "venue": "VR '99 Proceedings of the IEEE Virtual Reality", "citations": ["5390a96f20f70186a0ea3f94", "5390b00c20f70186a0ed624a", "5390b52620f70186a0f039d9", "5390b86b20f70186a0f28138", "5390881220f70186a0d7e182", "53908bde20f70186a0dc7384", "5390958a20f70186a0defce2"], "references": [], "authors": ["Ming Wan", "Huamin Qu", "Arie Kaufman"], "_id": {"$oid": "5797a655c60b4bee2dd600c8"}}, {"index": "53908bcc20f70186a0dc6cf7", "title": "Image Based Rendering with Stable Frame Rates", "abstract": "This paper presents an efficient keyframeless image-based renderingtechnique. An intermediate image is used to exploit the coherencesamong neighboring frames. The pixels in the intermediateimage are first rendered by a ray-casting method and then warpedto the intermediate image at the current viewpoint and view direction.We use an offset buffer to record the precise positions of thesepixels in the intermediate image. Every frame is generated in threesteps: warping the intermediate image onto the frame, filling inholes, and selectively rendering a group of old pixels. By dynamicallyadjusting the number of those old pixels in the last step, theworkload at every frame can be balanced. The pixels generated bythe last two steps make contributions to the new intermediate image.Unlike occasional keyframes in conventional image-based renderingwhich need to be totally rerendered, intermediate images onlyneed to be partially updated at every frame. In this way, we guaranteemore stable frame rates and more uniform image qualities. Theintermediate image can be warped efficiently by a modified incremental3D warp algorithm. As a specific application, we demonstrateour technique with a voxel-based terrain rendering system.", "year": "2000", "venue": "VISUALIZATION '00 Proceedings of the 11th IEEE Visualization 2000 Conference (VIS 2000)", "citations": ["5390ad8920f70186a0ec094d", "5390b86b20f70186a0f29690"], "references": [], "authors": ["Huamin Qu", "Ming Wan", "Jiafa Qin", "Arie Kaufman"], "_id": {"$oid": "5797a53fc60b4bede9e80ff8"}}, {"index": "53908bcc20f70186a0dc6cf7", "title": "Image Based Rendering with Stable Frame Rates", "abstract": "This paper presents an efficient keyframeless image-based renderingtechnique. An intermediate image is used to exploit the coherencesamong neighboring frames. The pixels in the intermediateimage are first rendered by a ray-casting method and then warpedto the intermediate image at the current viewpoint and view direction.We use an offset buffer to record the precise positions of thesepixels in the intermediate image. Every frame is generated in threesteps: warping the intermediate image onto the frame, filling inholes, and selectively rendering a group of old pixels. By dynamicallyadjusting the number of those old pixels in the last step, theworkload at every frame can be balanced. The pixels generated bythe last two steps make contributions to the new intermediate image.Unlike occasional keyframes in conventional image-based renderingwhich need to be totally rerendered, intermediate images onlyneed to be partially updated at every frame. In this way, we guaranteemore stable frame rates and more uniform image qualities. Theintermediate image can be warped efficiently by a modified incremental3D warp algorithm. As a specific application, we demonstrateour technique with a voxel-based terrain rendering system.", "year": "2000", "venue": "VISUALIZATION '00 Proceedings of the 11th IEEE Visualization 2000 Conference (VIS 2000)", "citations": ["5390ad8920f70186a0ec094d", "5390b86b20f70186a0f29690"], "references": [], "authors": ["Huamin Qu", "Ming Wan", "Jiafa Qin", "Arie Kaufman"], "_id": {"$oid": "5797a624c60b4bee2dd3680b"}}, {"index": "53908bde20f70186a0dc7384", "title": "Interactive Stereoscopic Rendering of Voxel-Based Terrain", "abstract": "We present an interactive stereoscopic rendering algorithm of voxel-based terrain. It provides unambiguous depth information of a terrain scene by generating perspective images for a pair of eyes with a horizontal parallax. The left-eye image is generated using a fast ray casting algorithm accelerated by exploiting a specific ray coherence method in the voxel-based terrain scene. The right-eye image is obtained by exploiting the frame coherence between the two views. Most of the pixel values are directly obtained from the left image by reprojection. The remaining pixels are computed by ray casting, while further accelerated with ray coherence. An A-buffer is employed to reduce image error caused by reprojection to non-integer pixel locations. Image-based task partitioning schemes are explored to effectively parallelize our algorithm on a multiprocessor.", "year": "2000", "venue": "VR '00 Proceedings of the IEEE Virtual Reality 2000 Conference", "citations": ["5390a2be20f70186a0e64b57", "5390b86b20f70186a0f28138", "539089ab20f70186a0d96b41", "5390958a20f70186a0defce2", "539096cb20f70186a0df7a7b"], "references": ["539087c720f70186a0d58413", "539087d920f70186a0d60c93", "539087dd20f70186a0d62834", "5390878720f70186a0d36057", "539089bb20f70186a0d98825", "539089bb20f70186a0d98e0c", "539089bb20f70186a0d991e6", "53908bde20f70186a0dc732a", "5390958a20f70186a0def70b"], "authors": ["Ming Wan", "Nan Zhang", "Arie Kaufman", "Huamin Qu"], "_id": {"$oid": "5797a812c60b4bee2deaa741"}}, {"index": "5390881220f70186a0d7e182", "title": "Image based rendering with stable frame rates", "abstract": "", "year": "2000", "venue": "Proceedings of the conference on Visualization '00", "citations": ["5390979920f70186a0e00564", "5390980720f70186a0e041ec", "539098b820f70186a0e0a275", "539098b820f70186a0e0a6f0", "5390b52620f70186a0f039d9", "5390b7ff20f70186a0f2774c", "5390b86b20f70186a0f28138", "5390881820f70186a0d8162e", "5390881820f70186a0d81649", "539089ab20f70186a0d96b41"], "references": ["539087c720f70186a0d588fe", "539087cf20f70186a0d5cbb8", "539087dd20f70186a0d644a9", "539087e720f70186a0d67ccb", "539087eb20f70186a0d6a62b", "539087eb20f70186a0d6c0b6", "539087f320f70186a0d70fad", "539087f820f70186a0d72a69", "5390879920f70186a0d41b8b", "539089bb20f70186a0d98825", "539089bb20f70186a0d991e6", "53908bde20f70186a0dc732a", "53908f5b20f70186a0ddaa6c", "5390958a20f70186a0def70b"], "authors": ["Huamin Qu", "Ming Wan", "Jiafa Qin", "Arie Kaufman"], "_id": {"$oid": "5797a819c60b4bee2deafb4e"}}, {"index": "5390b86b20f70186a0f28138", "title": "Accelerating voxel-based terrain rendering with keyframe-free image-based rendering", "abstract": "We propose a voxel-based terrain rendering method which incorporates a novel keyframe-free image-based rendering algorithm and a new heuristic ray coherence raycasting algorithm. The current image is generated by warping the previous image with a revised 3D warping algorithm and filling holes by raycasting, accelerated by ray coherence and multiresolution ray traversal. This method not only achieves good performance, but also allows arbitrary viewing directions. We further accelerate the rendering with multiprocessor parallelism and have achieved a real-time rendering rate of 30Hz on a 16-processor SGI Power Challenge.", "year": "2001", "venue": "VG'01 Proceedings of the 2001 Eurographics conference on Volume Graphics", "citations": [], "references": ["539087af20f70186a0d4ea4f", "539087d920f70186a0d60c84", "539087d920f70186a0d60c83", "539087d920f70186a0d60c8c", "539087e720f70186a0d67ccb", "539087eb20f70186a0d6a62b", "539087eb20f70186a0d6c0b6", "539087f820f70186a0d72a69", "5390881220f70186a0d7e182", "539089bb20f70186a0d98825", "53908b9320f70186a0dc14be", "53908bde20f70186a0dc732a", "53908bde20f70186a0dc7384", "53908bde20f70186a0dc74ae", "5390940320f70186a0de9646", "5390956e20f70186a0deb8eb", "5390958a20f70186a0def70b"], "authors": ["Jiafa Qin", "Ming Wan", "Huamin Qu", "Arie Kaufman"], "_id": {"$oid": "5797a6b5c60b4bee2ddad575"}}, {"index": "539098b820f70186a0e0a6f0", "title": "A Framework for Sample-Based Rendering with O-Buffers", "abstract": "We present an innovative modeling and rendering primitive, called the O-buffer, for sample-based graphics, such as images, volumes, and points. The 2D or 3D O-buffer is in essence a conventional image or a volume, respectively, except that samples are not restricted to a regular grid. A sample position in the O-buffer is recorded as an offset to the nearest grid point of a regular base grid (hence the name O-buffer). The offset is typically quantized for compact representation and efficient rendering. The O-buffer emancipates pixels and voxels from the regular grids and can greatly improve the modeling power of images and volumes. It is a semi-regular structure which lends itself to efficient construction and rendering. Image quality can be improved by storing more spatial information with samples and by avoiding multiple resamplings and delaying reconstruction to the final rendering stage. Using O-buffers, more accurate multi-resolution representations can be developed for images and volumes. It can also be exploited to represent and render unstructured primitives, such as points, particles, curvilinear or irregular volumes. The O-buffer is therefore a uniform representation for a variety of graphics primitives and supports mixing them in the same scene. We demonstrate the effectiveness of the O-buffer with hierarchical O-buffers, layered depth O-buffers, and hybrid volume rendering with O-buffers.", "year": "2003", "venue": "Proceedings of the 14th IEEE Visualization 2003 (VIS'03)", "citations": ["5390979920f70186a0e011a0"], "references": ["5390879920f70186a0d41b8b", "539087a120f70186a0d47480", "539087dd20f70186a0d644a9", "539087e120f70186a0d65878", "539087eb20f70186a0d6a62b", "539087eb20f70186a0d6c0ca", "539087f320f70186a0d70fad", "539087f320f70186a0d70faa", "539087f820f70186a0d72a2e", "5390880220f70186a0d77fc1", "5390880220f70186a0d77fb4", "5390880220f70186a0d77ffd", "5390880220f70186a0d77fd5", "5390880220f70186a0d77fd9", "5390881220f70186a0d7e182", "5390881220f70186a0d7e167", "5390881720f70186a0d7fc22", "5390893e20f70186a0d927fc", "539089ab20f70186a0d96a8a", "539089ab20f70186a0d96a89", "539089bb20f70186a0d9881d", "53908bad20f70186a0dc3147", "53908f5b20f70186a0ddaa44"], "authors": ["Huamin Qu", "Arie Kaufman", "Ran Shao", "Ankush Kumar"], "_id": {"$oid": "5797a88fc60b4bee2df11ea8"}}, {"index": "5390b5c620f70186a0f08b32", "title": "O-buffer: a framework for sample-based graphics", "abstract": "We present an innovative modeling and rendering primitive, called the O-buffer, as a framework for sample-based graphics. The 2D or 3D O-buffer is, in essence, a conventional image or a volume, respectively, except that samples are not restricted to a regular grid. A sample position in the O-buffer is recorded as an offset to the nearest grid point of a regular base grid (hence the name O-buffer). The O-buffer can greatly improve the expressive power of images and volumes. Image quality can be improved by storing more spatial information with samples and by avoiding multiple resamplings. It can be exploited to represent and render unstructured primitives, such as points, particles, and curvilinear or irregular volumes. The O-buffer is therefore a unified representation for a variety of graphics primitives and supports mixing them in the same scene. It is a semiregular structure which lends itself to efficient construction and rendering. O-buffers may assume a variety of forms including 2D O-buffers, 3D O-buffers, uniform O-buffers, nonuniform O-buffers, adaptive O-buffers, layered-depth O-buffers, and O-buffer trees. We demonstrate the effectiveness of the O-buffer in a variety of applications, such as image-based rendering, point sample rendering, and volume rendering.", "year": "2004", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390979920f70186a0e011a0", "53909f8c20f70186a0e3f76b", "53909fbc20f70186a0e4141d", "5390ab8820f70186a0eb1745", "5390b7ff20f70186a0f276ab"], "references": [], "authors": ["H. Qu", "A. E. Kaufman"], "_id": {"$oid": "5797a686c60b4bee2dd87313"}}, {"index": "5390979920f70186a0e011a3", "title": "SHIC: A View-Dependent Rendering Framework for Isosurfaces", "abstract": "We present Selective and Hierarchical Isopoint Clustering (SHIC) as a framework for interactive isosurface visualization.SHIC is an octree-based vertex hierarchy where each surface component in a cell is represented by a vertex (isopoint) with encoded connectivity. We describe a novel connectivity encoding scheme, called Connectivity Encoding Bitmap, and two topology-preserving isopoint clustering algorithms to build the vertex hierarchy.Our framework is able to cluster surface components with up to four intersection points on a cell edge.During rendering, an incremental isosurface extraction algorithm is used to construct the isosurface dynamically. Events associated with vertex tree modifications and active vertices changes are unified using timestamps.Our framework is efficient, space-saving, and suitable for rendering large isosurface objects with local modifications.", "year": "2004", "venue": "VV '04 Proceedings of the 2004 IEEE Symposium on Volume Visualization and Graphics", "citations": [], "references": ["5390979920f70186a0e00563", "5390878720f70186a0d34653", "539087d920f70186a0d60c92", "539087dd20f70186a0d62a4b", "539087dd20f70186a0d62a4c", "539087e120f70186a0d65872", "539087e120f70186a0d65878", "539087e120f70186a0d65876", "539087e620f70186a0d67544", "539087eb20f70186a0d6c095", "5390880720f70186a0d79c18", "5390881220f70186a0d7e186", "5390881220f70186a0d7e183", "5390881720f70186a0d7fbff", "5390881720f70186a0d7fbfe", "5390882d20f70186a0d8ddfe", "5390882d20f70186a0d8dec8", "539089ab20f70186a0d96ab3", "539089ab20f70186a0d96b64", "539089ab20f70186a0d96b3d", "53908bcc20f70186a0dc6ccf", "539098b820f70186a0e0a6ef", "539098b820f70186a0e0a6e1", "539098b820f70186a0e0a6c4"], "authors": ["Nan Zhang", "Huamin Qu", "Wei Hong", "Arie Kaufman"], "_id": {"$oid": "5797a690c60b4bee2dd8fa1f"}}, {"index": "539098b820f70186a0e0b7e8", "title": "O-buffer: a framework for sample-based graphics", "abstract": "Sample-based primitives, such as volumes from medical imaging and scientific simulation, images taken from the real world, and points from 3D range scanners, have been widely used in visualization and computer graphics. With advances in 3D scanning technologies and scientific simulations, irregular samples are becoming increasingly important. How to organize and render these irregular samples is an important and challenging research problem. This thesis describes the O-buffer, a new modeling and rendering primitive, and its associated algorithms and applications. The 2D or 3D O-buffer is in essence a conventional image or a volume, respectively, except that samples are not restricted to a regular grid. A sample position in the O-buffer is recorded as an offset to the grid point of a regular base grid (hence the name O-buffer). The offset is typically quantized for compact representation and efficient rendering. O-buffers can greatly improve the modeling power of images and volumes. The O-buffer emancipates pixels and voxels from regular grids. It is a semi-regular structure, which lends itself to efficient construction and rendering. Image quality can be improved by storing more spatial information with samples and by avoiding multiple resamplings and delaying reconstruction to the final rendering stage. Using O-buffers, more accurate multi-resolution representations can be developed for images and volumes. It can also be exploited to represent and render unstructured primitives, such as points, particles, and curvilinear or irregular volumes. The O-buffer is therefore a uniform representation for a variety of graphics primitives and supports mixing them in the same scene. We present a family of new modeling and rendering primitives under the general umbrella of “O-buffer”. Included among these are 2D O-buffers, 3D O-buffers, nonuniform O-buffers, adaptive O-buffers, layered-depth O-buffers, hierarchical O-buffers, O-buffer trees, offset distance fields and unified distance fields. In addition, efficient construction and rendering algorithms for O-buffers are presented. The O-buffer is further used as a framework to attack a wide range of problems in image-based rendering, point sample rendering, volume rendering, and solid modeling.", "year": "2004", "venue": "O-buffer: a framework for sample-based graphics", "citations": [], "references": [], "authors": ["Arie Kaufman", "Huamin Qu"], "_id": {"$oid": "5797a702c60b4bee2dde1e4d"}}, {"index": "5390979920f70186a0e011a0", "title": "Feature Preserving Distance Fields", "abstract": "We present two distance field representations which can preserve sharp features in original geometric models: the offset distance field (ODF) and the unified distance field (UDF). The ODF is sampled on a special curvilinear grid named an offset grid. The sample points of the ODF are not on a regular grid and they can float in the cells of a regular base grid. The ODF can naturally adapt to curvature variations in the original mesh and can preserve sharp features. We describe an energy minimization approach to convert geometric models to ODFs. The UDF integrates multiple distance field representations into one data structure. By adaptively using different representations for different parts of a shape, the UDF can provide high fidelity surface representation with compact storage and fast rendering speed.", "year": "2004", "venue": "VV '04 Proceedings of the 2004 IEEE Symposium on Volume Visualization and Graphics", "citations": ["5390ab8820f70186a0eb1745"], "references": ["5390878720f70186a0d34653", "539087b320f70186a0d510ec", "539087dd20f70186a0d62a4c", "539087e720f70186a0d68f5f", "539087eb20f70186a0d6c049", "539087eb20f70186a0d6c04e", "539087f820f70186a0d72a6a", "5390880220f70186a0d77fb4", "5390881220f70186a0d7e186", "5390881720f70186a0d7fbff", "5390881720f70186a0d7fbfe", "5390882d20f70186a0d8dec8", "539089ab20f70186a0d96aa4", "539089bb20f70186a0d98878", "5390958a20f70186a0def6af", "539098b820f70186a0e0a6f0", "5390b5c620f70186a0f08b32"], "authors": ["Huamin Qu", "Nan Zhang", "Ran Shao", "Arie Kaufman", "Klaus Mueller"], "_id": {"$oid": "5797a722c60b4bee2ddf8129"}}, {"index": "5390958a20f70186a0defce2", "title": "Interactive Stereoscopic Rendering of Volumetric Environments", "abstract": "Abstract--We present an efficient stereoscopic rendering algorithm supporting interactive navigation through large-scale 3D voxel-based environments. In this algorithm, most of the pixel values of the right image are derived from the left image by a fast 3D warping based on a specific stereoscopic projection geometry. An accelerated volumetric ray casting then fills the remaining gaps in the warped right image. Our algorithm has been parallelized on a multiprocessor by employing effective task partitioning schemes and achieved a high cache coherency and load balancing. We also extend our stereoscopic rendering to include view-dependent shading and transparency effects. We have applied our algorithm in two virtual navigation systems, flythrough over terrain and virtual colonoscopy, and reached interactive stereoscopic rendering rates of more than 10 frames per second on a 16-processor SGI Challenge.", "year": "2004", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["53909a0220f70186a0e1ef0b", "53909f8c20f70186a0e40bc4", "5390a93b20f70186a0ea07ad", "5390b7fe20f70186a0f26e95"], "references": ["5390877920f70186a0d2f056", "539087ae20f70186a0d4cd13", "539087b320f70186a0d5110e", "539087c720f70186a0d56ea4", "539087c720f70186a0d58413", "539087cb20f70186a0d59e80", "539087cf20f70186a0d5cb7e", "539087cf20f70186a0d5cbb8", "539087dd20f70186a0d62834", "539087e120f70186a0d65817", "539087e620f70186a0d6759a", "539087e720f70186a0d6933b", "539087eb20f70186a0d6a62b", "539087eb20f70186a0d6c0b6", "539087eb20f70186a0d6c0be", "539087f820f70186a0d72a77", "539087f820f70186a0d72a74", "5390880220f70186a0d77ffd", "5390880220f70186a0d77fd5", "5390881720f70186a0d7fc22", "5390878720f70186a0d36057", "539089bb20f70186a0d98825", "539089bb20f70186a0d98e0c", "53908bad20f70186a0dc3147", "53908bde20f70186a0dc732a", "53908bde20f70186a0dc7384", "53908f5b20f70186a0ddaa44", "53908f5b20f70186a0ddaa6c"], "authors": ["Ming Wan", "Nan Zhang", "Huamin Qu", "Arie E. Kaufman"], "_id": {"$oid": "5797a882c60b4bee2df06c9d"}}, {"index": "53909ee020f70186a0e32fcc", "title": "CSG operations on point models with implicit connectivity", "abstract": "This paper presents a geometric wrinkle model based on facial muscles for realistically and efficiently simulating wrinkles generated in facial expressions. Our method simulates wrinkles on an anatomy-based face model that mimics the layered structure ...", "year": "2005", "venue": "CGI '05 Proceedings of the Computer Graphics International 2005", "citations": ["5390a9a420f70186a0ea4ff0"], "references": [], "authors": ["N. Zhang", "H. Qu", "A. Kaufman"], "_id": {"$oid": "5797a78ac60b4bee2de47e29"}}, {"index": "5390a93b20f70186a0ea19d3", "title": "Controllable and progressive edge clustering for large networks", "abstract": "Node-link diagrams are widely used in information visualization to show relationships among data. However, when the size of data becomes very large, node-link diagrams will become cluttered and visually confusing for users. In this paper, we propose a novel controllable edge clustering method based on Delaunay triangulation to reduce visual clutter for node-link diagrams. Our method uses curves instead of straight lines to represent links and these curves can be grouped together according to their relative positions and directions. We further introduce progressive edge clustering to achieve continuous level-of-details for large networks.", "year": "2006", "venue": "GD'06 Proceedings of the 14th international conference on Graph drawing", "citations": ["5390b64020f70186a0f1a102", "5390b95520f70186a0f2f78e", "5390b95520f70186a0f2f738"], "references": ["5390979920f70186a0e010d4", "5390990f20f70186a0e10042", "539087d920f70186a0d60c92", "539089d320f70186a0d9b915", "5390aeba20f70186a0ecaff0", "5390b2d720f70186a0eec370"], "authors": ["Huamin Qu", "Hong Zhou", "Yingcai Wu"], "_id": {"$oid": "5797a595c60b4bede9eb6ebe"}}, {"index": "5390a93b20f70186a0ea19d3", "title": "Controllable and progressive edge clustering for large networks", "abstract": "Node-link diagrams are widely used in information visualization to show relationships among data. However, when the size of data becomes very large, node-link diagrams will become cluttered and visually confusing for users. In this paper, we propose a novel controllable edge clustering method based on Delaunay triangulation to reduce visual clutter for node-link diagrams. Our method uses curves instead of straight lines to represent links and these curves can be grouped together according to their relative positions and directions. We further introduce progressive edge clustering to achieve continuous level-of-details for large networks.", "year": "2006", "venue": "GD'06 Proceedings of the 14th international conference on Graph drawing", "citations": ["5390b64020f70186a0f1a102", "5390b95520f70186a0f2f78e", "5390b95520f70186a0f2f738"], "references": ["5390979920f70186a0e010d4", "5390990f20f70186a0e10042", "539087d920f70186a0d60c92", "539089d320f70186a0d9b915", "5390aeba20f70186a0ecaff0", "5390b2d720f70186a0eec370"], "authors": ["Huamin Qu", "Hong Zhou", "Yingcai Wu"], "_id": {"$oid": "5797a664c60b4bee2dd6c6d1"}}, {"index": "5390b2d620f70186a0eebc89", "title": "MIP-Guided vascular image visualization with multi-dimensional transfer function", "abstract": "Direct volume rendering (DVR) is an effective way to visualize 3D vascular images for diagnosis of different vascular pathologies and planning of surgical treatments. Angiograms are typically noisy, fuzzy, and contain thin vessel structures. Therefore, some kinds of enhancements are usually needed before direct volume rendering can start. However, without visualizing the 3D structures in angiograms, users may find it difficult to select appropriate parameters and assess the effectiveness of the enhancement results. In addition, traditional enhancement techniques cannot easily separate the vessel voxels from other contextual structures with the same or very similar intensity. In this paper, we propose a framework to integrate enhancement and direct volume rendering into one visualization pipeline using multi-dimensional transfer function tailored for visualizing the curvilinear and line structures in angiograms. Furthermore, we present a feature preserving interpolation method to render very thin vessels which are usually missed using traditional approaches. To ease the difficulty in vessel selection, a MIP-guided method is suggested to assist the process.", "year": "2006", "venue": "CGI'06 Proceedings of the 24th international conference on Advances in Computer Graphics", "citations": ["5390b36120f70186a0ef1d6d"], "references": ["5390979920f70186a0dffa2c", "5390979920f70186a0e00554", "5390981d20f70186a0e0511c", "539098dd20f70186a0e0ea21", "5390878720f70186a0d36057", "539087eb20f70186a0d6c063", "539087eb20f70186a0d6c0db", "539089ab20f70186a0d96ab6", "539089ab20f70186a0d96b2d", "539089bb20f70186a0d9888d", "539089bb20f70186a0d988ce", "5390b64020f70186a0f1995d"], "authors": ["Ming-Yuen Chan", "Yingcai Wu", "Huamin Qu", "Albert C. S. Chung", "Wilbur C. K. Wong"], "_id": {"$oid": "5797a678c60b4bee2dd7c555"}}, {"index": "5390b36120f70186a0ef1d54", "title": "Fusing features in direct volume rendered images", "abstract": "In this paper, we propose a novel framework which can fuse multiple user selected features in different direct volume rendered images into a comprehensive image according to users’ preference. The framework relies on three techniques, i.e., user voting, genetic algorithm, and image similarity. In this framework, we transform the fusing problem to an optimization problem with a novel energy function which is based on user voting and image similarity. The optimization problem can then be solved by the genetic algorithm. Experimental results on some real volume data demonstrate the effectiveness of our framework.", "year": "2006", "venue": "ISVC'06 Proceedings of the Second international conference on Advances in Visual Computing - Volume Part I", "citations": ["5390b48420f70186a0efb99d", "5390b86b20f70186a0f2815b"], "references": ["5390981d20f70186a0e043c0", "5390985d20f70186a0e07db5", "539087a120f70186a0d47493", "539087d420f70186a0d5f52c", "539087dd20f70186a0d62a17", "539087e120f70186a0d6589c", "539087eb20f70186a0d6c063", "539087f820f70186a0d72a31", "539089bb20f70186a0d988b1", "539090c420f70186a0ddf29f", "539096cb20f70186a0df7124", "5390b5c620f70186a0f08b23"], "authors": ["Yingcai Wu", "Huamin Qu", "Hong Zhou", "Ming-Yuen Chan"], "_id": {"$oid": "5797a70dc60b4bee2dde98e1"}}, {"index": "5390b36120f70186a0ef1d6d", "title": "Viewpoint selection for angiographic volume", "abstract": "In this paper, we present a novel viewpoint selection framework for angiographic volume data. We propose several view descriptors based on typical concerns of clinicians for the view evaluation. Compared with conventional approaches, our method can deliver a more representative global optimal view by sampling at a much higher rate in the view space. Instead of performing analysis on sample views individually, we construct a solution space to estimate the quality of the views. Descriptor values are propagated to the solution space where an efficient searching process can be performed. The best viewpoint can be found by analyzing the accumulated descriptor values in the solution space based on different visualization goals.", "year": "2006", "venue": "ISVC'06 Proceedings of the Second international conference on Advances in Visual Computing - Volume Part I", "citations": ["53909f8c20f70186a0e3f767", "5390a06e20f70186a0e4c3aa", "5390a2be20f70186a0e64b73", "5390ac1820f70186a0eb32b8", "5390b95520f70186a0f2f75d"], "references": ["5390985d20f70186a0e0859e", "5390b2d620f70186a0eebc89", "5390878720f70186a0d3635c", "539087e720f70186a0d69342", "53908af920f70186a0dafcb9", "5390b7fe20f70186a0f26e9a"], "authors": ["Ming-Yuen Chan", "Huamin Qu", "Yingcai Wu", "Hong Zhou"], "_id": {"$oid": "5797a76fc60b4bee2de32609"}}, {"index": "539099b320f70186a0e1a875", "title": "Natural Textures for Weather Data Visualization", "abstract": "In this paper we present a novel method to visualize weather data with multi-layer controllable texture synthesis. Texture possesses multiple principal perceptual channels, which makes it good at encoding multiple data attributes contained in weather data. The natural textures existed in the real world especially provide plenty of choices to encode the data with visually pleasing images. A controllable texture synthesis method is developed to generate a large amount of textures which change the appearances of their individual perceptual dimensions according to the underlying distribution of data attributes. In order to encode more data attributes we further propose multi-layer texture synthesis. The background and foreground textures are separately synthesized and then combined together for display. In the end, we apply our method to some real-world weather data and demonstrate its effectiveness with a user study.", "year": "2006", "venue": "IV '06 Proceedings of the conference on Information Visualization", "citations": ["53909f8c20f70186a0e3f797", "5390b64020f70186a0f1aac0"], "references": [], "authors": ["Ying Tang", "Huamin Qu", "Yingcai Wu", "Hong Zhou"], "_id": {"$oid": "5797a7ecc60b4bee2de8964e"}}, {"index": "5390b48420f70186a0efb99f", "title": "A perceptual framework for comparisons of direct volume rendered images", "abstract": "Direct volume rendering (DVR) has been widely used by physicians, scientists, and engineers in many applications. There are various DVR algorithms and the images generated by these algorithms are somewhat different. Because these direct volume rendered images will be perceived by human beings, it is important to evaluate their quality based on human perception. One of the key perceptual factors is that whether and how the visible differences between two images will be observed by users. In this paper we propose a perceptual framework, which is based on the Visible Differences Predictor (VDP), for comparing the direct volume rendered images generated with different algorithms or the same algorithm with different specifications such as shading method, gradient estimation scheme, and sampling rate. Our framework consists of a volume rendering engine and a VDP component. The experimental results on some real volume data show that the visible differences between two direct volume rendered images can be measured quantitatively with our framework. Our method can help users choose suitable DVR algorithms and specifications for their applications from a perceptual perspective and steer the visualization process.", "year": "2006", "venue": "PSIVT'06 Proceedings of the First Pacific Rim conference on Advances in Image and Video Technology", "citations": ["53909f8c20f70186a0e3f7af"], "references": ["539098b820f70186a0e0a6dc", "53909a9320f70186a0e21a7b", "539087c720f70186a0d56f63", "539087c720f70186a0d58381", "5390878720f70186a0d36057", "5390879920f70186a0d41b8b", "539087d920f70186a0d60927", "539087eb20f70186a0d6a654", "539087eb20f70186a0d6c076", "539087f320f70186a0d70f91", "5390880720f70186a0d78aee", "5390880720f70186a0d79c21", "539089ab20f70186a0d96b50", "539089bb20f70186a0d9882d", "539089bb20f70186a0d988b6", "53908ae020f70186a0dadc32", "53908af920f70186a0daff1a", "53908b4920f70186a0dbc85f"], "authors": ["Hon-Cheng Wong", "Huamin Qu", "Un-Hong Wong", "Zesheng Tang", "Klaus Mueller"], "_id": {"$oid": "5797a88fc60b4bee2df12540"}}, {"index": "5390b48420f70186a0efb99d", "title": "Focus + context visualization with animation", "abstract": "In this paper, we present some novel animation techniques to help users understand complex structures contained in volumetric data from the medical imaging and scientific simulation fields. Because of the occlusion of 3D objects, these complex structures and their 3D relationships usually cannot be revealed using one image. By our animation techniques, the focus regions, the context regions, and their relationships can be better visualized at the different stages of an animation. We propose an image-centric method which employs layered-depth images (LDIs) to get correct depth cues, and a data-centric method which exploits a novel transfer function fusing technique to guarantee the smooth transition between frames. The experimental results on real volume data demonstrate the advantages of our techniques over traditional image blending and transfer function interpolation methods.", "year": "2006", "venue": "PSIVT'06 Proceedings of the First Pacific Rim conference on Advances in Image and Video Technology", "citations": [], "references": ["5390979920f70186a0e0054a", "5390985d20f70186a0e07db5", "5390995d20f70186a0e14e7a", "5390aaf920f70186a0eaf0fd", "5390b36120f70186a0ef1d54", "5390877f20f70186a0d310ee", "539087eb20f70186a0d6a62b", "539089bb20f70186a0d988b1", "53908b4920f70186a0dbc85e", "539096cb20f70186a0df7124", "5390b5c620f70186a0f08b23", "5390b64020f70186a0f198a3"], "authors": ["Yingcai Wu", "Huamin Qu", "Hong Zhou", "Ming-Yuen Chan"], "_id": {"$oid": "5797a88fc60b4bee2df12542"}}, {"index": "53909f8c20f70186a0e3f797", "title": "Visual Analysis of the Air Pollution Problem in Hong Kong", "abstract": "We present a comprehensive system for weather data visualization. Weather data are multivariate and contain vector fields formed by wind speed and direction. Several well-established visualization techniques such as parallel coordinates and polar systems are integrated into our system. We also develop various novel methods, including circular pixel bar charts embedded into polar systems, enhanced parallel coordinates with S-shape axis, and weighted complete graphs. Our system was used to analyze the air pollution problem in Hong Kong and some interesting patterns have been found.", "year": "2007", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390a2be20f70186a0e64bd4", "5390aeba20f70186a0ec977d", "5390b64020f70186a0f1aac2", "5390b86b20f70186a0f29689", "5390b86b20f70186a0f2a405", "5390bb1d20f70186a0f3e0f7", "558afb73612c41e6b9d3f821"], "references": ["539099b320f70186a0e1a875", "53909a0220f70186a0e1f083", "53909a0220f70186a0e1f07b", "53909a9320f70186a0e21aa8", "5390881220f70186a0d7e1ba", "5390881220f70186a0d7e1c7", "539089bb20f70186a0d988cd", "53908b0320f70186a0db251b", "53908b4920f70186a0dbb887", "5390958a20f70186a0def693", "539095bb20f70186a0df2108", "5390aeba20f70186a0ecaff7", "5390b2d720f70186a0eec370", "5390b5c620f70186a0f08b2a"], "authors": ["Huamin Qu", "Wing-Yi Chan", "Anbang Xu", "Kai-Lun Chung", "Kai-Hon Lau", "Ping Guo"], "_id": {"$oid": "5797a59dc60b4bede9ebbaee"}}, {"index": "53909f8c20f70186a0e3f797", "title": "Visual Analysis of the Air Pollution Problem in Hong Kong", "abstract": "We present a comprehensive system for weather data visualization. Weather data are multivariate and contain vector fields formed by wind speed and direction. Several well-established visualization techniques such as parallel coordinates and polar systems are integrated into our system. We also develop various novel methods, including circular pixel bar charts embedded into polar systems, enhanced parallel coordinates with S-shape axis, and weighted complete graphs. Our system was used to analyze the air pollution problem in Hong Kong and some interesting patterns have been found.", "year": "2007", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390a2be20f70186a0e64bd4", "5390aeba20f70186a0ec977d", "5390b64020f70186a0f1aac2", "5390b86b20f70186a0f29689", "5390b86b20f70186a0f2a405", "5390bb1d20f70186a0f3e0f7", "558afb73612c41e6b9d3f821"], "references": ["539099b320f70186a0e1a875", "53909a0220f70186a0e1f083", "53909a0220f70186a0e1f07b", "53909a9320f70186a0e21aa8", "5390881220f70186a0d7e1ba", "5390881220f70186a0d7e1c7", "539089bb20f70186a0d988cd", "53908b0320f70186a0db251b", "53908b4920f70186a0dbb887", "5390958a20f70186a0def693", "539095bb20f70186a0df2108", "5390aeba20f70186a0ecaff7", "5390b2d720f70186a0eec370", "5390b5c620f70186a0f08b2a"], "authors": ["Huamin Qu", "Wing-Yi Chan", "Anbang Xu", "Kai-Lun Chung", "Kai-Hon Lau", "Ping Guo"], "_id": {"$oid": "5797a66ac60b4bee2dd71301"}}, {"index": "5390b86b20f70186a0f2815b", "title": "Quality enhancement of direct volume rendered images", "abstract": "In this paper, we propose a new method for enhancing the quality of direct volume rendered images. Unlike the typical image enhancement techniques which perform transformations in the image domain, we take the volume data into account and enhance the presentation of the volume in the rendered image by adjusting the rendering parameters. Our objective is not only to deliver a pleasing image with better color contrast or enhanced features, but also generate a faithful image with the information in the volume presented in the image. An image quality measurement is proposed to quantitatively evaluate image quality based on the information obtained from the image as well as the volumetric data. The parameter adjustment process is driven by the evaluation result using a genetic algorithm. More informative and comprehensible results are therefore delivered, compared with the typical image-based approaches.", "year": "2007", "venue": "VG'07 Proceedings of the Sixth Eurographics / Ieee VGTC conference on Volume Graphics", "citations": [], "references": ["5390985d20f70186a0e07708", "539087be20f70186a0d516f4", "5390b36120f70186a0ef1d54", "5390b64020f70186a0f19744", "5390b64020f70186a0f19832", "5390b64020f70186a0f19a2d", "5390b64020f70186a0f19a75", "5390878320f70186a0d32927", "5390878e20f70186a0d3a8db", "539087dd20f70186a0d62a17", "539087eb20f70186a0d6a66e", "5390882c20f70186a0d8c910", "539089ab20f70186a0d96b4b", "53908a5820f70186a0da1b05", "53908af920f70186a0dafcb9", "53908bde20f70186a0dc87d4"], "authors": ["Ming-Yuen Chan", "Yingcai Wu", "Huamin Qu"], "_id": {"$oid": "5797a6d7c60b4bee2ddc3fce"}}, {"index": "5390b5c620f70186a0f08b49", "title": "Interactive Transfer Function Design Based on Editing Direct Volume Rendered Images", "abstract": "Direct volume rendered images (DVRIs) have been widely used to reveal structures in volumetric data. However, DVRIs generated by many volume visualization techniques can only partially satisfy users' demands. In this paper, we propose a framework for editing DVRIs, which can also be used for interactive transfer function (TF) design. Our approach allows users to fuse multiple features in distinct DVRIs into a comprehensive one, to blend two DVRIs, and/or to delete features in a DVRI. We further present how these editing operations can generate smooth animations for focus + context visualization. Experimental results on some real volumetric data demonstrate the effectiveness of our method.", "year": "2007", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390aaf920f70186a0eae395", "5390b00c20f70186a0ed4ca0", "5390b64020f70186a0f1aabd", "5390b86b20f70186a0f28090", "5390b86b20f70186a0f28113", "5390b86b20f70186a0f2815c", "5390b95520f70186a0f2f73e", "5390b95520f70186a0f2f75e", "5390b9d520f70186a0f30f26", "558b31d4612c41e6b9d46549", "558b8f12612c6b62e5e8b85f"], "references": [], "authors": ["Yingcai Wu", "Huamin Qu"], "_id": {"$oid": "5797a742c60b4bee2de1149d"}}, {"index": "5390b86b20f70186a0f2815c", "title": "Palette-style volume visualization", "abstract": "In this paper we propose a palette-style volume visualization interface which aims at providing users with an intuitive volume exploration tool. Our system is inspired by the widely used wheel-style color palette. The system initially creates a set of direct volume rendered images (DVRIs) manually or automatically, and arranges them over a circle in 2D image space. Based on the initial set of DVRIs called primary DVRIs which imitate the primary colors in the color wheel, users can create more DVRIs on the wheel using PhotoShop-style image editing operations such as the fusing operation. With our system, non-expert users can easily navigate and explore volumetric data. In addition, users can always know where they have been, where they are, and where they could go in a visualization process and hence redundant exploration can be avoided.", "year": "2007", "venue": "VG'07 Proceedings of the Sixth Eurographics / Ieee VGTC conference on Volume Graphics", "citations": [], "references": ["5390979920f70186a0dffe53", "5390979920f70186a0e010c1", "5390981d20f70186a0e043c0", "5390990f20f70186a0e10e30", "539099ec20f70186a0e1ce80", "53909a9320f70186a0e21ab1", "53909eef20f70186a0e3586b", "5390aeba20f70186a0ecaff1", "5390b5c620f70186a0f08b49", "539087d420f70186a0d5f52c", "5390879920f70186a0d41949", "539087e120f70186a0d6589c", "539087eb20f70186a0d6c063", "539087f820f70186a0d72a31", "5390882720f70186a0d8ac5e", "539089bb20f70186a0d988b3", "539089bb20f70186a0d988ce", "539089bb20f70186a0d990c7", "5390958a20f70186a0defce5"], "authors": ["Yingcai Wu", "Anbang Xu", "Ming-Yuen Chan", "Huamin Qu", "Ping Guo"], "_id": {"$oid": "5797a7b1c60b4bee2de6566d"}}, {"index": "5390b95520f70186a0f2f738", "title": "Visual clustering in parallel coordinates", "abstract": "Parallel coordinates have been widely applied to visualize high-dimensional and multivariate data, discerning patterns within the data through visual clustering. However, the effectiveness of this technique on large data is reduced by edge clutter. In this paper, we present a novel framework to reduce edge clutter, consequently improving the effectiveness of visual clustering. We exploit curved edges and optimize the arrangement of these curved edges by minimizing their curvature and maximizing the parallelism of adjacent edges. The overall visual clustering is improved by adjusting the shape of the edges while keeping their relative order. The experiments on several representative datasets demonstrate the effectiveness of our approach.", "year": "2008", "venue": "EuroVis'08 Proceedings of the 10th Joint Eurographics / IEEE - VGTC conference on Visualization", "citations": ["5390ac1820f70186a0eb3df2", "5390b19020f70186a0edff8a", "5390b29820f70186a0ee9516", "5390b86b20f70186a0f2816f", "5390b86b20f70186a0f2a405", "5390b95520f70186a0f2f73f", "5390b95520f70186a0f2f772", "5390b95520f70186a0f2f7b5", "5390b95520f70186a0f2f744", "5390bae520f70186a0f3bd6d", "558b2da2612c41e6b9d45c94", "558bd46d0cf23f2dfc593e48"], "references": ["5390975920f70186a0dfcfe5", "5390979920f70186a0e010c6", "5390979920f70186a0e010c7", "5390990f20f70186a0e10037", "5390990f20f70186a0e10045", "539099a220f70186a0e1708b", "53909a9320f70186a0e21ad5", "53909a9320f70186a0e21a84", "53909a9320f70186a0e21aa5", "53909f8c20f70186a0e3f783", "53909f8c20f70186a0e3f786", "5390a93b20f70186a0ea19d3", "5390aeba20f70186a0ecaff0", "5390aeba20f70186a0ecaff7", "539087dd20f70186a0d6285c", "539087f820f70186a0d72a2c", "539089d320f70186a0d9b77c", "53908af920f70186a0db0741", "53908cde20f70186a0dcd8d8", "5390956e20f70186a0ded95e", "5390958a20f70186a0def693"], "authors": ["Hong Zhou", "Xiaoru Yuan", "Huamin Qu", "Weiwei Cui", "Baoquan Chen"], "_id": {"$oid": "5797a688c60b4bee2dd88e62"}}, {"index": "5390a2be20f70186a0e64b12", "title": "VoxelBars: An Informative Interface for Volume Visualization", "abstract": "In this paper, we present VoxelBars as an informative interface for volume visualization. VoxelBars arrange voxels into a 2D space and visually encode multiple attributes of voxels into one display. VoxelBars allow users to easily find out clusters of interesting voxels, set opacities and colors of a specific group of voxels, and achieve various sophisticated visualization tasks at voxel level. We provide results on real volume data to demonstrate the advantages of the VoxelBars over scatterplots and traditional transfer function specification methods. Some novel visualization techniques including visibility-aware transfer function design and selective clipping based on VoxelBars are also introduced.", "year": "2008", "venue": "ISVC '08 Proceedings of the 4th International Symposium on Advances in Visual Computing", "citations": ["5390bf1320f70186a0f5145c"], "references": ["5390979920f70186a0dffe53", "539098b820f70186a0e0a6f8", "539098b820f70186a0e0a70f", "53909a9320f70186a0e21ab1", "53909a9320f70186a0e21ab7", "53909eef20f70186a0e3588f", "539087dd20f70186a0d62a17", "539087e120f70186a0d6589c", "539087eb20f70186a0d6c063", "539089ab20f70186a0d96aa5", "539089bb20f70186a0d988cd", "5390b7ff20f70186a0f27710"], "authors": ["Wai-Ho Mak", "Ming-Yuen Chan", "Yingcai Wu", "Ka-Kei Chung", "Huamin Qu"], "_id": {"$oid": "5797a746c60b4bee2de141cd"}}, {"index": "5390a28020f70186a0e62b8b", "title": "Relation-Aware Volume Exploration Pipeline", "abstract": "Volume exploration is an important issue in scientific visualization. Research on volume exploration has been focused on revealing hidden structures in volumetric data.While the information of individual structures or features is useful in practice, spatial relations between structures are also important in many applications and can provide further insights into the data. In this paper, we systematically study the extraction, representation,exploration, and visualization of spatial relations in volumetric data and propose a novel relation-aware visualization pipeline for volume exploration. In our pipeline, various relations in the volume are first defined and measured using region connection calculus (RCC) and then represented using a graph interface called relation graph. With RCC and the relation graph, relation query and interactive exploration can be conducted in a comprehensive and intuitive way. The visualization process is further assisted with relation-revealing viewpoint selection and color and opacity enhancement. We also introduce a quality assessment scheme which evaluates the perception of spatial relations in the rendered images. Experiments on various datasets demonstrate the practical use of our system in exploratory visualization.", "year": "2008", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390ac1820f70186a0eb3349", "5390ad5620f70186a0ebe1d1"], "references": [], "authors": ["Ming-Yuen Chan", "Huamin Qu", "Ka-Kei Chung", "Wai-Ho Mak", "Yingcai Wu"], "_id": {"$oid": "5797a79ac60b4bee2de54ea2"}}, {"index": "5390a1d420f70186a0e57821", "title": "Knowledge Discovery by Network Visualization", "abstract": "Hyperlinks among webpages are very important information and are widely used for webpage clustering and webpage ranking. With the explosive growth in the number of webpages available online, the exploration of hyperlinks among webpages becomes a very challenging problem. Information visualization provides an effective way of visualizing hyperlinks and can help users gain insights into the relationships of webpages.In this paper, we present some novel computer graphics techniques to visualize the hyperlinks among webpages. We propose a visual encoding scheme for five dimensional hyperlinks data and two constrained 3D layout techniques for incoming and outgoing links of a single webpage. To reveal the hierarchical structure of webpages as well as the hyperlinks information, we extend the treemap representation. Our representations are visually appealing and can effectively reveal linkage patterns among webpages. Experimental results and a user study demonstrate the effectiveness of our system. Our system can facilitate E-learning and help students understand the complex structures and hidden patterns in network datasets.", "year": "2008", "venue": "Edutainment '08 Proceedings of the 3rd international conference on Technologies for E-Learning and Digital Entertainment", "citations": [], "references": ["5390979920f70186a0e010d0", "53909eef20f70186a0e3675e", "539087dd20f70186a0d62b49", "539087e720f70186a0d69091", "53908cde20f70186a0dcd893", "5390956e20f70186a0debeae", "5390956e20f70186a0ded979"], "authors": ["Hong Zhou", "Yingcai Wu", "Ming-Yuen Chan", "Huamin Qu", "Zhengmao Xie", "Xiaoming Li"], "_id": {"$oid": "5797a7a1c60b4bee2de5a4b8"}}, {"index": "5390a28020f70186a0e62bb5", "title": "Geometry-Based Edge Clustering for Graph Visualization", "abstract": "Graphs have been widely used to model relationships among data. For large graphs, excessive edge crossings make the display visually cluttered and thus difﬁcult to explore. In this paper, we propose a novel geometry-based edge-clustering framework that can group edges into bundles to reduce the overall edge crossings. Our method uses a control mesh to guide the edge-clustering process; edge bundles can be formed by forcing all edges to pass through some control points on the mesh. The control mesh can be generated at different levels of detail either manually or automatically based on underlying graph patterns. Users can further interact with the edge-clustering results through several advanced visualization techniques such as color and opacity enhancement. Compared with other edge-clustering methods, our approach is intuitive, ﬂexible, and efﬁcient. The experiments on some large graphs demonstrate the effectiveness of our method.", "year": "2008", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390ab8820f70186a0eb1223", "5390af8820f70186a0ecf06e", "5390b4c320f70186a0efd91d", "5390b4c320f70186a0efd91c", "5390b5ed20f70186a0f0c344", "5390b5ed20f70186a0f0c354", "5390b64020f70186a0f1a102", "5390b78a20f70186a0f23c8f", "5390b95520f70186a0f2f745", "5390b95520f70186a0f2f78e", "5390b95520f70186a0f2f744", "5390b95520f70186a0f2f7c5", "5390ba3820f70186a0f35004", "5390bb1d20f70186a0f3e0ec", "5390bfa220f70186a0f5361b", "558af7e3612c41e6b9d3ef5a"], "references": [], "authors": ["Weiwei Cui", "Hong Zhou", "Huamin Qu", "Pak Chung Wong", "Xiaoming Li"], "_id": {"$oid": "5797a7a5c60b4bee2de5ccb2"}}, {"index": "5390a2be20f70186a0e64b73", "title": "An Efficient Quality-Based Camera Path Planning Method for Volume Exploration", "abstract": "Volume visualization is an effective means for exploring information in volumetric data. To improve the visualization process, we propose a novel method for systematic revelation and illustration of the volume by presenting the data in a visual trail. Based on a novel propagation framework, we develop a feature and quality driven approach for viewpoint selection and camera path construction. Good candidate viewpoints selected are covered in the path. To connect the viewpoints in a proper manner, potential fields are established using the projection maps and camera paths are derived accordingly. This path planning method can deliver useful guidance for volume exploration. Experiments on volumetric datasets have been conducted for demonstration.", "year": "2008", "venue": "ISVC '08 Proceedings of the 4th International Symposium on Advances in Visual Computing, Part II", "citations": [], "references": ["5390985d20f70186a0e0859e", "53909a9320f70186a0e21ac0", "539087aa20f70186a0d4aba4", "539087d920f70186a0d60cbc", "539087e620f70186a0d6755b", "5390b36120f70186a0ef1d6d"], "authors": ["Ming-Yuen Chan", "Wai-Ho Mak", "Huamin Qu"], "_id": {"$oid": "5797a8eec60b4bee2df60308"}}, {"index": "5390a6d920f70186a0e87dbc", "title": "Scattering Points in Parallel Coordinates", "abstract": "In this paper, we present a novel parallel coordinates design integrated with points (Scattering Points in Parallel Coordinates, SPPC), by taking advantage of both parallel coordinates and scatterplots. Different from most multiple views visualization frameworks involving parallel coordinates where each visualization type occupies an individual window, we convert two selected neighboring coordinate axes into a scatterplot directly. Multidimensional scaling is adopted to allow converting multiple axes into a single subplot. The transition between two visual types is designed in a seamless way. In our work, a series of interaction tools has been developed. Uniform brushing functionality is implemented to allow the user to perform data selection on both points and parallel coordinate polylines without explicitly switching tools. A GPU accelerated Dimensional Incremental Multidimensional Scaling (DIMDS) has been developed to significantly improve the system performance. Our case study shows that our scheme is more efficient than traditional multi-view methods in performing visual analysis tasks.", "year": "2009", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390ac1820f70186a0eb3df2", "5390b0ca20f70186a0ed9c88", "5390b29820f70186a0ee9516", "5390b5ed20f70186a0f0c337", "5390b64020f70186a0f1aac2", "5390b68720f70186a0f1d27b", "5390b86b20f70186a0f2a405", "5390b95520f70186a0f2f73f", "5390b95520f70186a0f2f7b5", "5390b95520f70186a0f2f7b3", "5390bb1d20f70186a0f3e0f7", "558b2da2612c41e6b9d45c94", "558b50c6612c41e6b9d48ff9"], "references": [], "authors": ["Xiaoru Yuan", "Peihong Guo", "He Xiao", "Hong Zhou", "Huamin Qu"], "_id": {"$oid": "5797a559c60b4bede9e90e6b"}}, {"index": "5390b95520f70186a0f2f772", "title": "Splatting the lines in parallel coordinates", "abstract": "In this paper, we propose a novel splatting framework for clutter reduction and pattern revealing in parallel coordinates. Our framework consists of two major components: a polyline splatter for cluster detection and a segment splatter for clutter reduction. The cluster detection is performed by splatting the lines one by one into the parallel coordinates plots, and for each splatted line we enhance its neighboring lines and suppress irrelevant ones. To reduce visual clutter caused by line crossings and overlappings in the clustered results, we provide a segment splatter which represents each polyline by one segment and splats these segments with different speeds, colors, and lengths from the leftmost axis to the rightmost axis. Users can interactively control both the polyline splatting and the segment splatting processes to emphasize the features they are interested in. The experimental results demonstrate that our framework can effectively reveal some hidden patterns in parallel coordinates.", "year": "2009", "venue": "EuroVis'09 Proceedings of the 11th Eurographics / IEEE - VGTC conference on Visualization", "citations": ["5390ac1820f70186a0eb3df2", "5390b29820f70186a0ee9516", "5390b52620f70186a0f044fa", "5390b86b20f70186a0f2816f", "5390b95520f70186a0f2f73f", "5390b95520f70186a0f2f79a"], "references": ["5390975920f70186a0dfd91e", "5390979920f70186a0e010c6", "5390979920f70186a0e010c7", "5390990f20f70186a0e10037", "539099a220f70186a0e1708b", "539099a220f70186a0e179d5", "53909a9320f70186a0e21ad5", "53909a9320f70186a0e21aa5", "53909f8c20f70186a0e3f783", "53909f8c20f70186a0e3f786", "5390a28020f70186a0e62bbb", "5390aeba20f70186a0ecaff7", "5390b95520f70186a0f2f737", "5390b95520f70186a0f2f738", "539087dd20f70186a0d6285c", "539087f820f70186a0d72a2c", "539089bb20f70186a0d98870", "53908af920f70186a0db0741", "53908cde20f70186a0dcd8d8", "5390958a20f70186a0def693"], "authors": ["Hong Zhou", "Weiwei Cui", "Huamin Qu", "Yingcai Wu", "Xiaoru Yuan", "Wei Zhuo"], "_id": {"$oid": "5797a599c60b4bede9eb8a67"}}, {"index": "5390a6d920f70186a0e87dbc", "title": "Scattering Points in Parallel Coordinates", "abstract": "In this paper, we present a novel parallel coordinates design integrated with points (Scattering Points in Parallel Coordinates, SPPC), by taking advantage of both parallel coordinates and scatterplots. Different from most multiple views visualization frameworks involving parallel coordinates where each visualization type occupies an individual window, we convert two selected neighboring coordinate axes into a scatterplot directly. Multidimensional scaling is adopted to allow converting multiple axes into a single subplot. The transition between two visual types is designed in a seamless way. In our work, a series of interaction tools has been developed. Uniform brushing functionality is implemented to allow the user to perform data selection on both points and parallel coordinate polylines without explicitly switching tools. A GPU accelerated Dimensional Incremental Multidimensional Scaling (DIMDS) has been developed to significantly improve the system performance. Our case study shows that our scheme is more efficient than traditional multi-view methods in performing visual analysis tasks.", "year": "2009", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390ac1820f70186a0eb3df2", "5390b0ca20f70186a0ed9c88", "5390b29820f70186a0ee9516", "5390b5ed20f70186a0f0c337", "5390b64020f70186a0f1aac2", "5390b68720f70186a0f1d27b", "5390b86b20f70186a0f2a405", "5390b95520f70186a0f2f73f", "5390b95520f70186a0f2f7b5", "5390b95520f70186a0f2f7b3", "5390bb1d20f70186a0f3e0f7", "558b2da2612c41e6b9d45c94", "558b50c6612c41e6b9d48ff9"], "references": [], "authors": ["Xiaoru Yuan", "Peihong Guo", "He Xiao", "Hong Zhou", "Huamin Qu"], "_id": {"$oid": "5797a637c60b4bee2dd4667e"}}, {"index": "5390b95520f70186a0f2f772", "title": "Splatting the lines in parallel coordinates", "abstract": "In this paper, we propose a novel splatting framework for clutter reduction and pattern revealing in parallel coordinates. Our framework consists of two major components: a polyline splatter for cluster detection and a segment splatter for clutter reduction. The cluster detection is performed by splatting the lines one by one into the parallel coordinates plots, and for each splatted line we enhance its neighboring lines and suppress irrelevant ones. To reduce visual clutter caused by line crossings and overlappings in the clustered results, we provide a segment splatter which represents each polyline by one segment and splats these segments with different speeds, colors, and lengths from the leftmost axis to the rightmost axis. Users can interactively control both the polyline splatting and the segment splatting processes to emphasize the features they are interested in. The experimental results demonstrate that our framework can effectively reveal some hidden patterns in parallel coordinates.", "year": "2009", "venue": "EuroVis'09 Proceedings of the 11th Eurographics / IEEE - VGTC conference on Visualization", "citations": ["5390ac1820f70186a0eb3df2", "5390b29820f70186a0ee9516", "5390b52620f70186a0f044fa", "5390b86b20f70186a0f2816f", "5390b95520f70186a0f2f73f", "5390b95520f70186a0f2f79a"], "references": ["5390975920f70186a0dfd91e", "5390979920f70186a0e010c6", "5390979920f70186a0e010c7", "5390990f20f70186a0e10037", "539099a220f70186a0e1708b", "539099a220f70186a0e179d5", "53909a9320f70186a0e21ad5", "53909a9320f70186a0e21aa5", "53909f8c20f70186a0e3f783", "53909f8c20f70186a0e3f786", "5390a28020f70186a0e62bbb", "5390aeba20f70186a0ecaff7", "5390b95520f70186a0f2f737", "5390b95520f70186a0f2f738", "539087dd20f70186a0d6285c", "539087f820f70186a0d72a2c", "539089bb20f70186a0d98870", "53908af920f70186a0db0741", "53908cde20f70186a0dcd8d8", "5390958a20f70186a0def693"], "authors": ["Hong Zhou", "Weiwei Cui", "Huamin Qu", "Yingcai Wu", "Xiaoru Yuan", "Wei Zhuo"], "_id": {"$oid": "5797a666c60b4bee2dd6e27a"}}, {"index": "5390a6d920f70186a0e87d8c", "title": "Focus+Context Route Zooming and Information Overlay in 3D Urban Environments", "abstract": "In this paper we present a novel focus+context zooming technique, which allows users to zoom into a route and its associated landmarks in a 3D urban environment from a 45-degree bird’s-eye view. Through the creative utilization of the empty space in an urban environment, our technique can informatively reveal the focus region and minimize distortions to the context buildings. We first create more empty space in the 2D map by broadening the road with an adapted seam carving algorithm. A grid-based zooming technique is then used to enlarge the landmarks to reclaim the created empty space and thus reduce distortions to the other parts. Finally,an occlusion-free route visualization scheme adaptively scales the buildings occluding the route to make the route always visible to users. Our method can be conveniently integrated into Google Earth and Virtual Earth to provide seamless route zooming and help users better explore a city and plan their tours. It can also be used in other applications such as information overlay to a virtual city.", "year": "2009", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b13020f70186a0edce17", "5390b64020f70186a0f1a104", "5390b9d520f70186a0f31cfa"], "references": [], "authors": ["Huamin Qu", "Haomian Wang", "Weiwei Cui", "Yingcai Wu", "Ming-Yuen Chan"], "_id": {"$oid": "5797a69fc60b4bee2dd9b8c2"}}, {"index": "5390a77d20f70186a0e8f274", "title": "Integrated Tourist Navigation System", "abstract": "Tourist navigation systems have used digital maps to provide users with location and route information for a long time. However, without detailed 3D building models, users may miss important turns at some intersections and have problems to find their target buildings. With the advent of Google Earth and Microsoft Virtual Earth, 3D models of buildings in major cities worldwide can be conveniently created and shared. In this paper, we present two methods, i.e., overlay-style blending and Escher-style blending, to seamlessly integrate 2D maps and 3D buildings into a tourist navigation system. We also provide useful visual cues indicating occluded roads and buildings. Our solutions can be applied to other navigation systems such as interactive city guide maps.", "year": "2009", "venue": "CGIV '09 Proceedings of the 2009 Sixth International Conference on Computer Graphics, Imaging and Visualization", "citations": ["5390b04120f70186a0ed8808"], "references": [], "authors": ["Haomian Wang", "Weiwei Cui", "Hong Zhou", "Yingcai Wu", "Huamin Qu"], "_id": {"$oid": "5797a79fc60b4bee2de58f8d"}}, {"index": "5390a6d920f70186a0e87dde", "title": "Perception-Based Transparency Optimization for Direct Volume Rendering", "abstract": "The semi-transparent nature of direct volume rendered images is useful to depict layered structures in a volume. However, obtaining a semi-transparent result with the layers clearly revealed is difficult and may involve tedious adjustment on opacity and other rendering parameters. Furthermore, the visual quality of layers also depends on various perceptual factors. In this paper, we propose an auto-correction method for enhancing the perceived quality of the semi-transparent layers in direct volume rendered images. We introduce a suite of new measures based on psychological principles to evaluate the perceptual quality of transparent structures in the rendered images. By optimizing rendering parameters within an adaptive and intuitive user interaction process, the quality of the images is enhanced such that specific user requirements can be met. Experimental results on various datasets demonstrate the effectiveness and robustness of our method", "year": "2009", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b13020f70186a0edd842", "5390b86b20f70186a0f28172", "5390b86b20f70186a0f28171", "5390b95520f70186a0f2f766", "5390b95520f70186a0f2f7aa", "5390b9d520f70186a0f305be", "5390bb1d20f70186a0f3df0d", "5390bf1320f70186a0f51aa1", "558b1b48612c41e6b9d43757"], "references": [], "authors": ["Ming-Yuen Chan", "Yingcai Wu", "Wai-Ho Mak", "Wei Chen", "Huamin Qu"], "_id": {"$oid": "5797a7d5c60b4bee2de76261"}}, {"index": "5390a6d920f70186a0e87d96", "title": "Interactive Visual Optimization and Analysis for RFID Benchmarking", "abstract": "Radio frequency identification (RFID) is a powerful automatic remote identification technique that has wide applications. To facilitate RFID deployment, an RFID benchmarking instrument called aGate has been invented to identify the strengths and weaknesses of different RFID technologies in various environments. However, the data acquired by aGate are usually complex time varying multidimensional 3D volumetric data, which are extremely challenging for engineers to analyze. In this paper, we introduce a set of visualization techniques, namely, parallel coordinate plots, orientation plots, a visual history mechanism, and a 3D spatial viewer, to help RFID engineers analyze benchmark data visually and intuitively. With the techniques, we further introduce two workflow procedures (a visual optimization procedure for finding the optimum reader antenna configuration and a visual analysis procedure for comparing the performance and identifying the flaws of RFID devices) for the RFID benchmarking, with focus on the performance analysis of the aGate system. The usefulness and usability of the system are demonstrated in the user evaluation.", "year": "2009", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": [], "references": [], "authors": ["Yingcai Wu", "Ka-Kei Chung", "Huamin Qu", "Xiaoru Yuan", "S. C. Cheung"], "_id": {"$oid": "5797a7e7c60b4bee2de85249"}}, {"index": "5390adfd20f70186a0ec611d", "title": "Quality enhancement and relation-aware exploration pipeline for volume visualization", "abstract": "With the advance of data acquisition methods, various kinds of high quality volumetric datasets are now available for medical and scientific purposes. Due to the explosive increase in size and complexity of the data, the analysis tasks involved pose difficult problems. Volume visualization provides an effective solution which aims at delivering insights of the underlying details or concepts by the means of computer graphics for creating useful views on the data. In fact, effective visualization requires the support of intuitive and interactive exploration techniques as well as proper rendering and presentation of the data in order to facilitate the users in acquiring insights and useful information from the volumes. This thesis focuses on the improvement of the rendered image quality and the exploration pipeline to facilitate the visualization process. In this thesis, we first present two exploration techniques for visualizing volumetric data. Instead of performing tedious manipulation on the volumes, we suggest a quality-driven camera path planning method and a relation-aware visualization pipeline to allow semi-automatic exploration of volumes. Volume features and high-level spatial relations are considered to determine the proper views on the volumes and our objective is to reveal this important information using the proposed visualization techniques. In the second part, the issues of rendered image quality are discussed and we propose two image quality enhancement approaches to ensure that the features in the volume are faithfully presented in the rendered images and correct perception of the volumes is obtained by viewers. An adaptive enhancement framework is also proposed to adjust the rendering parameters for obtaining optimal rendered images. To demonstrate the effectiveness of our solutions, experiments are conducted on different kinds of datasets and the results are evaluated and discussed.", "year": "2009", "venue": "Quality enhancement and relation-aware exploration pipeline for volume visualization", "citations": [], "references": [], "authors": ["Huamin Qu", "Ming-Yuen Chan"], "_id": {"$oid": "5797a842c60b4bee2ded13bb"}}, {"index": "5390a6d920f70186a0e87da4", "title": "A Novel Interface for Interactive Exploration of DTI Fibers", "abstract": "Visual exploration is essential to the visualization and analysis of densely sampled 3D DTI fibers in biological speciments, due to the high geometric, spatial, and anatomical complexity of fiber tracts. Previous methods for DTI fiber visualization use zooming, color-mapping, selection, and abstraction to deliver the characteristics of the fibers. However, these schemes mainly focus on the optimization of visualization in the 3D space where cluttering and occlusion make grasping even a few thousand fibers difficult. This paper introduces a novel interaction method that augments the 3D visualization with a 2D representation containing a low-dimensional embedding of the DTI fibers. This embedding preserves the relationship between the fibers and removes the visual clutter that is inherent in 3D renderings of the fibers. This new interface allows the user to manipulate the DTI fibers as both 3D curves and 2D embedded points and easily compare or validate his or her results in both domains. The implementation of the framework is GPU based to achieve real-time interaction. The framework was applied to several tasks, and the results show that our method reduces the user’s workload in recognizing 3D DTI fibers and permits quick and accurate DTI fiber selection.", "year": "2009", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b64020f70186a0f1a100"], "references": [], "authors": ["Wei Chen", "Zi'ang Ding", "Song Zhang", "Anna MacKay-Brandt", "Stephen Correia", "Huamin Qu", "John Allen Crow", "David F. Tate", "Zhicheng Yan", "Qunsheng Peng"], "_id": {"$oid": "5797a85bc60b4bee2dee578e"}}, {"index": "5390ac5720f70186a0eb5d63", "title": "Crowdsourcing and service delivery", "abstract": "Today, service delivery organizations operate in a highly dynamic, complex, competitive, and globally distributed environment. There is constant pressure to reduce costs and improve performance and quality. Success demands the ability to continuously learn and adapt. Standardization is recognized as essential to reducing variation and, therefore, costs, as well as managing quality. Public frameworks and standards, such as ITIL® (Information Technology Infrastructure Library), provide best-practice guidance and a common vocabulary for managing IT (information technology) services. In this paper, we explore the role that social networking and \"crowdsourcing\" can play in socializing and developing best practices for a service delivery organization. We draw on our experience developing and deploying a social networking application, called Cyano, which is being used by approximately 13,000 IT professionals to capture and maintain day-to-day activities, processes, and artifacts used for problem and change management of several hundred outsourced infrastructures. Cyano is a new breed of social networking enterprise applications, in which crowdsourcing is leveraged to enrich and maintain IT processes and social networks are not created by explicit membership, but rather are implicitly discovered by the type of activities and infrastructure elements that various users support. In this paper, we focus on 1) the architecture of Cyano for supporting social tagging and linkage across different layers of management applications, 2) process customization and governance, and 3) an automated recommendation system that has been well received by thousands of IT professionals. We also highlight research challenges in this space.", "year": "2009", "venue": "IBM Journal of Research and Development", "citations": [], "references": ["5390972920f70186a0dfbe4e", "539098b820f70186a0e0a843", "539098dc20f70186a0e0d806", "5390990f20f70186a0e0ff78", "5390994d20f70186a0e1274f", "5390995d20f70186a0e1662c", "539099b320f70186a0e19a2f", "539099b320f70186a0e19a4a", "53909ee020f70186a0e33b2e", "53909f2d20f70186a0e38baa", "5390a1f820f70186a0e5c1da", "5390a2be20f70186a0e63c2e", "5390a54720f70186a0e78832", "5390878e20f70186a0d3a411", "539087ef20f70186a0d6e1ac", "539089d320f70186a0d9bcfc", "53908b4920f70186a0dbc410"], "authors": ["H. Jamjoom", "H. Qu", "M. J. Buco", "M. Hernandez", "D. Saha", "M. Naghshineh"], "_id": {"$oid": "5797a8ccc60b4bee2df4431a"}}, {"index": "5390adfd20f70186a0ec61d1", "title": "Interactive editing and automatic evaluation of direct volume rendered images", "abstract": "Direct Volume Rendering is a powerful volume visualization method which allows users to visually explore the volume datasets in a highly flexible manner. Despite the powerful capability of direct volume rendering for exploring volume data, its inherent complexity of specifying rendering parameters often results in a tedious and non-intuitive visualization process. In addition, because of its complicated ray casting and compositing process, its results (direct volume rendered images) usually contain misleading information such as artifacts and depth ambiguity, which makes the visualization unreliable and ineffective for volume exploration. In this thesis, we present four methods for improving the intuitiveness and effectiveness of direct volume rendering as follows. (1) An editing framework for direct volume rendered images, allowing users to interactively explore complex volumetric datasets by directly editing direct volume rendered images. (2) A palette-style volume visualization method, which can automatically store and systematically organize intermediate results created during a volume visualization process, such that users can locate their desired results quickly and generate a new result based on the editing framework. (3) A new framework for creating depth-revealing and relation-preserving animations of direct volume rendered images based on the editing framework and an adapted fuzzy spatial ontology. (4) A set of quantitative effectiveness measures, i.e., the distinguishability, the edge consistency, the contour clarity, and the depth coherence measures, to evaluate the effectiveness of a direct volume rendered image or a whole visualization process from different perspectives. With these four proposed methods, a comprehensive volume visualization system has been developed, enabling users to interactively edit, intuitively organize, effectively animate, and automatically evaluate direct volume rendered images.", "year": "2009", "venue": "Interactive editing and automatic evaluation of direct volume rendered images", "citations": [], "references": [], "authors": ["Huamin Qu", "Yingcai Wu"], "_id": {"$oid": "5797a8cec60b4bee2df46490"}}, {"index": "5390adfd20f70186a0ec5f7f", "title": "Visual clustering in parallel coordinates and graphs", "abstract": "Information visualization has emerged as a very active research field for multivariate and relational data analysis in recent years. It turns complex and abstract data such as demographic data, financial data, social networks, and paper citations into visual representations, and then users can exploit interactive computer graphics techniques and human visual capabilities to gain insight into the data. Parallel coordinates and graphs are two well-established methods in information visualization. However, when data become very large, the effectiveness of both methods is dramatically reduced as tens of thousands of lines can easily overwhelm the display and the resulting visual clutter will obscure any underlying patterns. Thus, clutter reduction for parallel coordinates and graphs is a very important research problem in information visualization. In this thesis, we introduce visual clustering as a new approach for clutter reduction and pattern detection. Compared with traditional clutter reduction methods such as filtering and brushing, visual clustering can enhance and reveal interesting patterns in the data while preserving the context. For parallel coordinates, we present a force-based optimization method to bundle polylines by adjusting their shapes, and a splatting framework to reveal features with animations. For graphs, a geometry-based edge grouping approach and an energy-based hierarchical visual clustering scheme are proposed. The effectiveness of these methods has been demonstrated through extensive experiments using both synthetic data and datasets from real applications.", "year": "2009", "venue": "Visual clustering in parallel coordinates and graphs", "citations": [], "references": [], "authors": ["Huamin Qu", "Hong Zhou"], "_id": {"$oid": "5797a8efc60b4bee2df60e09"}}, {"index": "5390b04120f70186a0ed6d2c", "title": "A visual approach to text corpora comparison", "abstract": "Email is an important part of our lives, almost everyone has at least one email account. It is not uncommon for an average professional email user to receive/send over a hundred emails a day. With all these personal and professional messages accumulated over time, email becomes our personal archive. In recently years, many interesting techniques are developed to improve email management, visualize mailbox content, explore historical events, and discover hidden knowledge from these electronic archives. In this paper, we propose an approach to visualize and compare email archives with Streamgraphs and Tag Clouds. Our preliminary results demonstrate the capability of this technique to compare any general text corpora with temporal information.", "year": "2010", "venue": "Proceedings of the first international workshop on Intelligent visual interfaces for text analysis", "citations": [], "references": ["5390990f20f70186a0e10357", "5390995c20f70186a0e14198", "5390995d20f70186a0e15df4", "53909a0220f70186a0e1fbd4", "53909a0220f70186a0e201a2", "5390a28020f70186a0e62bb1", "5390a72220f70186a0e89638", "539087d920f70186a0d6115c", "539088b820f70186a0d90cae", "5390958920f70186a0deea5b", "539095ba20f70186a0df1842", "539096cb20f70186a0df71da"], "authors": ["Dixon Ip", "Ken Lau Ka Keung", "Weiwei Cui", "Huamin Qu", "Helen Shen"], "_id": {"$oid": "5797a68dc60b4bee2dd8cb80"}}, {"index": "5390b04120f70186a0ed6d26", "title": "Proceedings of the first international workshop on Intelligent visual interfaces for text analysis", "abstract": "", "year": "2010", "venue": "15th International Conference on Intelligent User Interfaces", "citations": [], "references": [], "authors": ["Shixia Liu", "Michelle X. Zhou", "Giuseppe Carenini", "Huamin Qu"], "_id": {"$oid": "5797a68dc60b4bee2dd8cbab"}}, {"index": "5390b04120f70186a0ed6d28", "title": "A dynamic visual interface for news stream analysis", "abstract": "In this paper, we introduce a new visualization primitive called TextWheel, and present a visual analytics system for news streams which can bring multiple attributes of the news articles and the macro/micro relations between news streams and keywords into one coherent analytical context and meanwhile convey the dynamic natures of news streams. We use our system to analyze several large-scale news corpora related to some major companies and the results demonstrate the high potential of our method.", "year": "2010", "venue": "Proceedings of the first international workshop on Intelligent visual interfaces for text analysis", "citations": ["558b0712612c41e6b9d40b68", "55323c1245cec66b6f9db1e6"], "references": ["5390985d20f70186a0e08561", "539087f320f70186a0d70f48", "53908b4920f70186a0dbad47"], "authors": ["Weiwei Cui", "Hong Zhou", "Huamin Qu", "Wenbin Zhang", "Steven Skiena"], "_id": {"$oid": "5797a68dc60b4bee2dd8cbb5"}}, {"index": "5390ada620f70186a0ec24be", "title": "OpinionSeer: Interactive Visualization of Hotel Customer Feedback", "abstract": "The rapid development of Web technology has resulted in an increasing number of hotel customers sharing their opinionson the hotel services. Effective visual analysis of online customer opinions is needed, as it has a significant impact on buildinga successful business. In this paper, we present OpinionSeer, an interactive visualization system that could visually analyze alarge collection of online hotel customer reviews. The system is built on a new visualization-centric opinion mining technique thatconsiders uncertainty for faithfully modeling and analyzing customer opinions. A new visual representation is developed to conveycustomer opinions by augmenting well-established scatterplots and radial visualization. To provide multiple-level exploration, weintroduce subjective logic to handle and organize subjective opinions with degrees of uncertainty. Several case studies illustrate theeffectiveness and usefulness of OpinionSeer on analyzing relationships among multiple data dimensions and comparing opinionsof different groups. Aside from data on hotel customer feedback, OpinionSeer could also be applied to visually analyze customeropinions on other products or services.", "year": "2010", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b29820f70186a0ee951a", "5390b9d520f70186a0f31038", "5390bb1d20f70186a0f3d1c4", "5390bfa220f70186a0f53cb8", "5390bfa220f70186a0f53ca0", "558af7e3612c41e6b9d3ef5a"], "references": [], "authors": ["Yingcai Wu", "Furu Wei", "Shixia Liu", "Norman Au", "Weiwei Cui", "Hong Zhou", "Huamin Qu"], "_id": {"$oid": "5797a6bec60b4bee2ddb38a6"}}, {"index": "5390a79f20f70186a0e91d5c", "title": "Visualizing the Semantic Structure in Classical Music Works", "abstract": "A major obstacle in the appreciation of classical music is that extensive training is required to understand musical structure and compositional techniques toward comprehending the thoughts behind the musical work. In this paper, we propose an innovative visualization solution to reveal the semantic structure in classical orchestral works such that users can gain insights into musical structure and appreciate the beauty of music. We formulate the semantic structure into macrolevel layer interactions, microlevel theme variations, and macro-micro relationships between themes and layers to abstract the complicated construction of a musical composition. The visualization has been applied with success in understanding some classical music works as supported by highly promising user study results with the general audience and very positive feedback from music students and experts, demonstrating its effectiveness in conveying the sophistication and beauty of classical music to novice users with informative and intuitive displays.", "year": "2010", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b13020f70186a0edcc6a", "5390b5ed20f70186a0f0c347", "5390bed320f70186a0f4e2d0"], "references": [], "authors": ["Wing-Yi Chan", "Huamin Qu", "Wai-Ho Mak"], "_id": {"$oid": "5797a713c60b4bee2ddee051"}}, {"index": "5390ada620f70186a0ec24c6", "title": "FacetAtlas: Multifaceted Visualization for Rich Text Corpora", "abstract": "Documents in rich text corpora usually contain multiple facets of information. For example, an article about a specific disease often consists of different facets such as symptom, treatment, cause, diagnosis, prognosis, and prevention. Thus, documents may have different relations based on different facets. Powerful search tools have been developed to help users locate lists of individual documents that are most related to specific keywords. However, there is a lack of effective analysis tools that reveal the multifaceted relations of documents within or cross the document clusters. In this paper, we present FacetAtlas, a multifaceted visualization technique for visually analyzing rich text corpora. FacetAtlas combines search technology with advanced visual analytical tools to convey both global and local patterns simultaneously. We describe several unique aspects of FacetAtlas, including (1) node cliques and multifaceted edges, (2) an optimized density map, and (3) automated opacity pattern enhancement for highlighting visual patterns, (4) interactive context switch between facets. In addition, we demonstrate the power of FacetAtlas through a case study that targets patient education in the health care domain. Our evaluation shows the benefits of this work, especially in support of complex multifaceted data analysis.", "year": "2010", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b20120f70186a0ee43d5", "5390b29820f70186a0ee9517", "5390b2d720f70186a0eed4ab", "5390b52620f70186a0f033ee", "5390b78a20f70186a0f22e25", "5390b86b20f70186a0f28af9", "5390b95520f70186a0f2f7a3", "5390b95520f70186a0f2f7a2", "5390bae520f70186a0f3bd6d", "5390bda020f70186a0f47655", "5390bfa220f70186a0f54bf6", "558af7e3612c41e6b9d3ef5a", "55916e450cf2e89307ca9c0f"], "references": [], "authors": ["Nan Cao", "Jimeng Sun", "Yu-Ru Lin", "David Gotz", "Shixia Liu", "Huamin Qu"], "_id": {"$oid": "5797a77ec60b4bee2de3eb81"}}, {"index": "5390b61e20f70186a0f14b6f", "title": "Context-Preserving, Dynamic Word Cloud Visualization", "abstract": "The proposed method uses context-preserving, dynamic word clouds to illustrate content evolution. It generates a sequence of word clouds in which related words are grouped together. This sequence is then coupled with a trend chart that summarizes content changes so that users can better explore large collections of documents.", "year": "2010", "venue": "IEEE Computer Graphics and Applications", "citations": ["5390b64020f70186a0f1a110", "5390b86b20f70186a0f28af9", "5390ba0a20f70186a0f33276", "5390baa120f70186a0f38d14", "5390bda020f70186a0f45d03", "5390bda020f70186a0f47655", "5390bed320f70186a0f4eb3a", "558b0d29612c41e6b9d41906", "558af7e3612c41e6b9d3ef5a", "558b13c0612c41e6b9d424c5"], "references": [], "authors": ["Weiwei Cui", "Yingcai Wu", "Shixia Liu", "Furu Wei", "M. X. Zhou", "Huamin Qu"], "_id": {"$oid": "5797a7eac60b4bee2de87ab6"}}, {"index": "5390a88c20f70186a0e9988d", "title": "Workshop on intelligent visual interfaces for text analysis", "abstract": "This workshop brought together researchers and practitioners from both text analytics and interactive visualization communities to explore, define, and develop intelligent visual interfaces that help enhance the consumption and quality of complex text analysis results. Using this workshop as a starting point, we aim to foster closer, interdisciplinary relationships among researchers from text analytics and interactive visualization communities, so they can combine their expertise together to better tackle the difficult problems that face the text analytics community today.", "year": "2010", "venue": "Proceedings of the 15th international conference on Intelligent user interfaces", "citations": [], "references": [], "authors": ["Shixia Liu", "Michelle X. Zhou", "Giuseppe Carenini", "Huamin Qu"], "_id": {"$oid": "5797a831c60b4bee2dec3194"}}, {"index": "5390b00c20f70186a0ed4ca0", "title": "Visibility-aware direct volume rendering", "abstract": "Direct volume rendering (DVR) is a powerful visualization technique which allcvs users to effectively explore and study volumetric datasets. Different transparency settings can be flexibly assigned to different structures such that some valuable information can be revealed in direct volume rendered images (DVRIs). However, end-users often feel that some risks are always associated with DVR because they do not know whether any important information is missing from the transparent regions of DVRIs. In this paper, we investigate how to semi-automatically ger erate a set of DVRIs and also an animation which can reveal information missed in the original DVRIs and meanwhile satisy some image quality criteria such as coherence. A complete framework is developed to tackle various problems related to the generation and quality evaluation of visibility-aware DVRIs and animations. Our technique can reduce the risk of using direct volume rendering and thus boost the confidence of users in volume rendering systems.", "year": "2011", "venue": "Journal of Computer Science and Technology", "citations": [], "references": ["5390985d20f70186a0e07db5", "539098b820f70186a0e0a6f8", "53909a0220f70186a0e1f08c", "53909a0220f70186a0e1f08b", "53909a9320f70186a0e21a7b", "53909a9320f70186a0e21aab", "5390a17720f70186a0e51c04", "5390a5b020f70186a0e7d2ee", "539087d420f70186a0d5f52c", "539087dd20f70186a0d62a17", "539087eb20f70186a0d6c063", "539089bb20f70186a0d990d7", "5390b5c620f70186a0f08b23", "5390b5c620f70186a0f08b49", "5390b64020f70186a0f19d19", "5390b64020f70186a0f1a722"], "authors": ["Wai-Ho Mak", "Yingcai Wu", "Ming-Yuen Chan", "Huamin Qu"], "_id": {"$oid": "5797a52ac60b4bede9e72f53"}}, {"index": "5390afc920f70186a0ed20ba", "title": "Orientation-Preserving Rod Elements for Real-Time Thin-Shell Simulation", "abstract": "We propose a new computation model for simulating elastic thin shells at interactive rates. Existing graphical simulation methods are mostly based on dihedral angle energy functions, which need to compute the first order and second order partial derivatives with respect to current vertex positions as bending forces and stiffness matrices. The symbolic derivatives are complicated in nonisometric element deformations. To simplify computing the derivatives, instead of directly constructing the dihedral angle energy, we use the orientation change energy of mesh edges. A continuum-mechanics-based orientation-preserving rod element model is developed to provide the bending forces. The advantage of our method is simple bending force and stiffness matrix computation, since in the rod model, we apply a novel incremental construction of the deformation gradient tensor to linearize both tensile and orientation deformations. Consequently, our model is efficient, easy to implement, and supports both quadrilateral and triangle meshes. It also treats shells and plates uniformly.", "year": "2011", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": [], "references": [], "authors": ["Nan Zhang", "Huamin Qu", "Robert Sweet"], "_id": {"$oid": "5797a549c60b4bede9e86d4c"}}, {"index": "5390b20120f70186a0ee5080", "title": "DICON: Interactive Visual Analysis of Multidimensional Clusters", "abstract": "Clustering as a fundamental data analysis technique has been widely used in many analytic applications. However, it is often difficult for users to understand and evaluate multidimensional clustering results, especially the quality of clusters and their semantics. For large and complex data, high-level statistical information about the clusters is often needed for users to evaluate cluster quality while a detailed display of multidimensional attributes of the data is necessary to understand the meaning of clusters. In this paper, we introduce DICON, an icon-based cluster visualization that embeds statistical information into a multi-attribute display to facilitate cluster interpretation, evaluation, and comparison. We design a treemap-like icon to represent a multidimensional cluster, and the quality of the cluster can be conveniently evaluated with the embedded statistical information. We further develop a novel layout algorithm which can generate similar icons for similar clusters, making comparisons of clusters easier. User interaction and clutter reduction are integrated into the system to help users more effectively analyze and refine clustering results for large datasets. We demonstrate the power of DICON through a user study and a case study in the healthcare domain. Our evaluation shows the benefits of the technique, especially in support of complex multidimensional cluster analysis.", "year": "2011", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b5c620f70186a0f08df9", "5390b78a20f70186a0f22e76", "5390b7fe20f70186a0f26a40", "5390bae520f70186a0f3bd6d", "5390bf1320f70186a0f50b64", "558b4ef7612c41e6b9d48ccf", "558af7e3612c41e6b9d3ef5a", "55916e450cf2e89307ca9c0f"], "references": [], "authors": ["Nan Cao", "David Gotz", "Jimeng Sun", "Huamin Qu"], "_id": {"$oid": "5797a57bc60b4bede9ea4dd7"}}, {"index": "5390b00c20f70186a0ed4ca0", "title": "Visibility-aware direct volume rendering", "abstract": "Direct volume rendering (DVR) is a powerful visualization technique which allcvs users to effectively explore and study volumetric datasets. Different transparency settings can be flexibly assigned to different structures such that some valuable information can be revealed in direct volume rendered images (DVRIs). However, end-users often feel that some risks are always associated with DVR because they do not know whether any important information is missing from the transparent regions of DVRIs. In this paper, we investigate how to semi-automatically ger erate a set of DVRIs and also an animation which can reveal information missed in the original DVRIs and meanwhile satisy some image quality criteria such as coherence. A complete framework is developed to tackle various problems related to the generation and quality evaluation of visibility-aware DVRIs and animations. Our technique can reduce the risk of using direct volume rendering and thus boost the confidence of users in volume rendering systems.", "year": "2011", "venue": "Journal of Computer Science and Technology", "citations": [], "references": ["5390985d20f70186a0e07db5", "539098b820f70186a0e0a6f8", "53909a0220f70186a0e1f08c", "53909a0220f70186a0e1f08b", "53909a9320f70186a0e21a7b", "53909a9320f70186a0e21aab", "5390a17720f70186a0e51c04", "5390a5b020f70186a0e7d2ee", "539087d420f70186a0d5f52c", "539087dd20f70186a0d62a17", "539087eb20f70186a0d6c063", "539089bb20f70186a0d990d7", "5390b5c620f70186a0f08b23", "5390b5c620f70186a0f08b49", "5390b64020f70186a0f19d19", "5390b64020f70186a0f1a722"], "authors": ["Wai-Ho Mak", "Yingcai Wu", "Ming-Yuen Chan", "Huamin Qu"], "_id": {"$oid": "5797a612c60b4bee2dd28766"}}, {"index": "5390afc920f70186a0ed20ba", "title": "Orientation-Preserving Rod Elements for Real-Time Thin-Shell Simulation", "abstract": "We propose a new computation model for simulating elastic thin shells at interactive rates. Existing graphical simulation methods are mostly based on dihedral angle energy functions, which need to compute the first order and second order partial derivatives with respect to current vertex positions as bending forces and stiffness matrices. The symbolic derivatives are complicated in nonisometric element deformations. To simplify computing the derivatives, instead of directly constructing the dihedral angle energy, we use the orientation change energy of mesh edges. A continuum-mechanics-based orientation-preserving rod element model is developed to provide the bending forces. The advantage of our method is simple bending force and stiffness matrix computation, since in the rod model, we apply a novel incremental construction of the deformation gradient tensor to linearize both tensile and orientation deformations. Consequently, our model is efficient, easy to implement, and supports both quadrilateral and triangle meshes. It also treats shells and plates uniformly.", "year": "2011", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": [], "references": [], "authors": ["Nan Zhang", "Huamin Qu", "Robert Sweet"], "_id": {"$oid": "5797a62cc60b4bee2dd3c55f"}}, {"index": "5390b20120f70186a0ee5080", "title": "DICON: Interactive Visual Analysis of Multidimensional Clusters", "abstract": "Clustering as a fundamental data analysis technique has been widely used in many analytic applications. However, it is often difficult for users to understand and evaluate multidimensional clustering results, especially the quality of clusters and their semantics. For large and complex data, high-level statistical information about the clusters is often needed for users to evaluate cluster quality while a detailed display of multidimensional attributes of the data is necessary to understand the meaning of clusters. In this paper, we introduce DICON, an icon-based cluster visualization that embeds statistical information into a multi-attribute display to facilitate cluster interpretation, evaluation, and comparison. We design a treemap-like icon to represent a multidimensional cluster, and the quality of the cluster can be conveniently evaluated with the embedded statistical information. We further develop a novel layout algorithm which can generate similar icons for similar clusters, making comparisons of clusters easier. User interaction and clutter reduction are integrated into the system to help users more effectively analyze and refine clustering results for large datasets. We demonstrate the power of DICON through a user study and a case study in the healthcare domain. Our evaluation shows the benefits of the technique, especially in support of complex multidimensional cluster analysis.", "year": "2011", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b5c620f70186a0f08df9", "5390b78a20f70186a0f22e76", "5390b7fe20f70186a0f26a40", "5390bae520f70186a0f3bd6d", "5390bf1320f70186a0f50b64", "558b4ef7612c41e6b9d48ccf", "558af7e3612c41e6b9d3ef5a", "55916e450cf2e89307ca9c0f"], "references": [], "authors": ["Nan Cao", "David Gotz", "Jimeng Sun", "Huamin Qu"], "_id": {"$oid": "5797a64ec60b4bee2dd5a5ea"}}, {"index": "5390b29820f70186a0eea5f5", "title": "A visual analytics system for metropolitan transportation", "abstract": "With the increasing availability of metropolitan transportation data, such as those from vehicle GPSs (Global Positioning Systems) and road-side sensors, it becomes viable for authorities, operators, as well as individuals to analyze the data for a better understanding of the transportation system and possibly improved utilization and planning of the system. We report our experience in building the VAST (Visual Analytics for Smart Transportation) system. Our key observation is that metropolitan transportation data are inherently visual as they are spatio-temporal around road networks. Therefore, we visualize traffic data together with digital maps and support analytical queries through this interactive visual interface. As a case study, we demonstrate VAST on real-world taxi GPS and meter data sets from 15, 000 taxis running two months in a Chinese city of over 10 million population. We discuss the technical challenges in data cleaning, storage, visualization, and query processing, and offer our first-hand lessons learned from developing the system.", "year": "2011", "venue": "Proceedings of the 19th ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems", "citations": ["558b7c03612c6b62e5e89af6", "558b7db0612c6b62e5e89d9d"], "references": ["5390975920f70186a0dfe318", "5390985d20f70186a0e06e70", "53909ed120f70186a0e315bc", "53909eef20f70186a0e358ab", "53909fca20f70186a0e45b62", "5390a01420f70186a0e46664", "5390a0b720f70186a0e4eaab", "5390a1bc20f70186a0e549ef", "5390a25820f70186a0e5f92e", "5390a25820f70186a0e5f949", "5390a37f20f70186a0e6db4f", "5390a5b020f70186a0e7de54", "5390a63c20f70186a0e82e79", "5390a6b120f70186a0e85254", "5390a72220f70186a0e8af20", "5390a79f20f70186a0e922d1", "5390a8b120f70186a0e9a9f0", "5390ac1720f70186a0eb28bc", "539087ef20f70186a0d6cae3"], "authors": ["Siyuan Liu", "Ce Liu", "Qiong Luo", "Lionel M. Ni", "Huamin Qu"], "_id": {"$oid": "5797a698c60b4bee2dd96140"}}, {"index": "5390b0ca20f70186a0ed9c92", "title": "Visual analysis of people's mobility pattern from mobile phone data", "abstract": "The large amount of phone call records from mobile operators in a city can inform us how many people are present in any given area and how many are entering or leaving. Each phone call record usually contains the caller and callee IDs, date and time, and the base station where the phone calls are made. As mobile phones are widely used in our daily life, many human behaviors can be revealed by analyzing mobile phone data. In this paper, we propose a comprehensive visual analysis system which can be used to analyze the population's mobility patterns from millions of phone call records. Our system consists of three major components: 1) visual analysis of user groups in a base station; 2) visual analysis of the mobility patterns on different user groups making phone calls in certain base stations; 3) visual analysis of handoff phone call records. Some well-established visualization techniques such as parallel coordinates and pixel-based representations have been integrated into our system. We also develop a novel visualization schemes, Voronoi-diagram-based visual encoding to reveal the unique features of mobile phone data. We have applied our system to real mobile phone data collected in a large city and obtained some interesting findings regarding people's mobility pattern.", "year": "2011", "venue": "Proceedings of the 2011 Visual Information Communication - International Symposium", "citations": ["5390bfa220f70186a0f54c04"], "references": ["5390979920f70186a0e002c9", "5390990f20f70186a0e10042", "53909a9320f70186a0e21a87", "53909a9320f70186a0e21a86", "53909f8c20f70186a0e3f77f", "53909f8c20f70186a0e3f77d", "53909f8c20f70186a0e3f77e", "5390a28020f70186a0e62b0f", "5390a5b020f70186a0e7de54"], "authors": ["Jiansu Pu", "Panpan Xu", "Huamin Qu", "Weiwei Cui", "Siyuan Liu", "Lionel Ni"], "_id": {"$oid": "5797a69cc60b4bee2dd98e10"}}, {"index": "5590ca5e0cf2baaad97169b7", "title": "Preface", "abstract": "Welcome to the proceedings of the IEEE Pacific Visualization Symposium 2011 which took place in Hong Kong, China, on March 1--4, 2011. After a very successful event in Kyoto in 2008, Beijing in 2009, and Taipei in 2010, this is the fourth PacificVis sponsored by the IEEE Visualization and Graphics Technical Committee (VGTC).", "year": "2011", "venue": "PACIFICVIS '11 Proceedings of the 2011 IEEE Pacific Visualization Symposium", "citations": [], "references": [], "authors": ["Giuseppe Di Battista", "Jean-Daniel Fekete", "Huamin Qu"], "_id": {"$oid": "5797a69cc60b4bee2dd996ab"}}, {"index": "5390b20120f70186a0ee505e", "title": "TextFlow: Towards Better Understanding of Evolving Topics in Text", "abstract": "Understanding how topics evolve in text data is an important and challenging task. Although much work has been devoted to topic analysis, the study of topic evolution has largely been limited to individual topics. In this paper, we introduce TextFlow, a seamless integration of visualization and topic mining techniques, for analyzing various evolution patterns that emerge from multiple topics. We first extend an existing analysis technique to extract three-level features: the topic evolution trend, the critical event, and the keyword correlation. Then a coherent visualization that consists of three new visual components is designed to convey complex relationships between them. Through interaction, the topic mining model and visualization can communicate with each other to help users refine the analysis result and gain insights into the data progressively. Finally, two case studies are conducted to demonstrate the effectiveness and usefulness of TextFlow in helping users understand the major topic evolution patterns in time-varying text data.", "year": "2011", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["5390b64020f70186a0f1a111", "5390b86b20f70186a0f28af9", "5390b86b20f70186a0f2a0b5", "5390ba0a20f70186a0f337e3", "5390ba3820f70186a0f34ef2", "5390ba3820f70186a0f35007", "5390bb1d20f70186a0f3d0f2", "5390bb1d20f70186a0f3df8f", "5390bb1d20f70186a0f3df8e", "5390bfa220f70186a0f54c15", "5390bfa220f70186a0f54c0c", "558af7e3612c41e6b9d3ef5a", "559124710cf232eb904faf58"], "references": [], "authors": ["Weiwei Cui", "Shixia Liu", "Li Tan", "Conglei Shi", "Yangqiu Song", "Zekai Gao", "Huamin Qu", "Xin Tong"], "_id": {"$oid": "5797a6dec60b4bee2ddc9114"}}, {"index": "5390bd1520f70186a0f451c0", "title": "Visual summarization and exploration of text streams", "abstract": "We are in the midst of a data explosion. Data in text format such as digitalized textural data and data from new social media like blogs and Twitter have been generated at an unprecedented rate. For example, Google Books has scanned and digitalized 15 million books, greatly increasing the accessibility of information all around the world. Twitter publishes more than 300 new messages every second, and the numbers keep increasing. However, exploring and analyzing this enormous amount of data become increasingly difficult. Information visualization can help analyze huge and complex data by turning them into visual representations to exploit the tremendous pattern-recognition capability of the human visual system. In this thesis, we propose three advanced text visualization techniques for summarizing and exploring various relation patterns existing in large time-varying text document collections. This thesis is composed of three main parts, each of which addresses an important problem in text visualization. In the first part, we present an enhanced word cloud layout that keeps the semantic relations between the displayed words in a sequence of word clouds generated over time for dynamic document data. In the second part, TextWheel is introduced to visualize complex micro-macro relations within news streams. In the last part, we deal with the splitting/merging patterns between topics that are extracted from text streams. We proposed TextFlow, which is inspired by river flows, to show various topic evolution patterns at different granularities. The effectiveness of these methods has been demonstrated through extensive experiments using both synthetic data and data from real applications.", "year": "2011", "venue": "Visual summarization and exploration of text streams", "citations": [], "references": [], "authors": ["Huamin Qu", "Weiwei Cui"], "_id": {"$oid": "5797a733c60b4bee2de05751"}}, {"index": "5390b0ca20f70186a0ed9c85", "title": "Proceedings of the 2011 Visual Information Communication - International Symposium", "abstract": "It is our pleasure to welcome you to the 2011 Visual Information Communication - International Symposium (VINCI '11), which is held at The Hong Kong University of Science and Technology, among the most prestigious in Asia. Visual communication through graphical or sign languages has long been conducted among human beings of different backgrounds or cultures, and in recent decades between human and machine. In today's digital world, visual information is typically encoded with various metaphors commonly used in daily life to facilitate rapid comprehension and easy analysis during the communication process. Visual information communication generally encompasses information visualization, graphical user-interfaces, visual analytics, and visual languages. It has been successfully employed in knowledge discovery, end-user programming, modeling, rapid systems prototyping, education, and design activities by people of many disciplines including architects, artists, children, engineers, and scientists. In addition, visual information is increasingly being used to facilitate human-human communication through the Internet and web technology, and electronic mobile devices. This event seeks to promote research exchanges that will benefit both researchers and industrial practitioners, and aims to bring together scientists and students working in main of the above mentioned research fields and applications of visual information communication. This year, we have received 34 submissions from 9 countries/regions. The program committee accepted 16 papers after a thorough review process, which you will be seeing presented over the next two days.", "year": "2011", "venue": "The 2011 Visual Information Communication - International Symposium", "citations": [], "references": [], "authors": ["Guozhong Dai", "Huamin Qu", "Masahito Hirakawa", "Xiaolong (Luke) Zhang"], "_id": {"$oid": "5797a75bc60b4bee2de2356e"}}, {"index": "5390b1d220f70186a0ee191d", "title": "ImpactWheel: Visual Analysis of the Impact of Online News", "abstract": "Online news usually describes various events over multiple topics. Some of them may generate great impact and affection on other events, organizations or people. For example, a bankruptcy news about a big company may generate a great impact on other companies. Detecting this kind of impact helps users better to understand the affection of a specified event and its epidemic. Powerful text mining techniques have been developed to help users to detect topic trends of news articles. However, there is a lack of effective analysis tools that analyze and reveal the news impact in an intuitive approach. In this paper, we introduce Impact Wheel, an explorative visual analysis system for topic driven news impact detection. We describe two unique aspects of Impact Wheel, including 1) topic driven impact analysis and 2) interactive rich context visualization. Experiments on performance evaluation show that our proposed approach outperforms the two baseline methods on topic driven impact analysis. In addition, we demonstrate the power of the Impact Wheel system through a case study, which shows the benefits of this work, especially in support of rich topic data analysis.", "year": "2011", "venue": "WI-IAT '11 Proceedings of the 2011 IEEE/WIC/ACM International Conferences on Web Intelligence and Intelligent Agent Technology - Volume 01", "citations": [], "references": ["5390972920f70186a0dfb09a", "539099a220f70186a0e19208", "53909ed120f70186a0e30f19", "53909ed120f70186a0e30f1e", "53909ee020f70186a0e323ca", "53909fbd20f70186a0e42e6f", "5390a05a20f70186a0e4a76b", "5390a06e20f70186a0e4ce64", "5390a25820f70186a0e5e897", "5390a25820f70186a0e5e8a4", "5390a40520f70186a0e6e577", "5390a4cc20f70186a0e7501a", "5390a55520f70186a0e79ac7", "5390aa0e20f70186a0ea7863", "5390ab8820f70186a0eb17a2", "5390ac1720f70186a0eb28bd", "5390aeba20f70186a0eca6a9", "539087ef20f70186a0d6ca17", "5390880d20f70186a0d7d1de", "53908b4920f70186a0dbbd69", "53908cde20f70186a0dcd8a1", "5390958920f70186a0deea5b", "5390b24320f70186a0ee615f"], "authors": ["Wei Wei", "Nan Cao", "Jon Atle Gulla", "Huamin Qu"], "_id": {"$oid": "5797a7e0c60b4bee2de801e3"}}, {"index": "5390b2fc20f70186a0eefa0c", "title": "SolarMap: Multifaceted Visual Analytics for Topic Exploration", "abstract": "Documents in rich text corpora often contain multiple facets of information. For example, an article from a medical document collection might consist of multifaceted information about symptoms, treatments, causes, diagnoses, prognoses, and preventions. Thus, documents in the collection may have different relations across each of these various facets. Topic analysis and exploration for such multi-relational corpora is a challenging visual analytic task. This paper presents Solar Map, a multifaceted visual analytic technique for visually exploring topics in multi-relational data. Solar Map simultaneously visualizes the topic distribution of the underlying entities from one facet together with keyword distributions that convey the semantic definition of each cluster along a secondary facet. Solar Map combines several visual techniques including 1) topic contour clusters and interactive multifaceted keyword topic rings, 2) a global layout optimization algorithm that aligns each topic cluster with its corresponding keywords, and 3) 2) an optimal temporal network segmentation and layout method that renders temporal evolution of clusters. Finally, the paper concludes with two case studies and quantitative user evaluation which show the power of the Solar Map technique.", "year": "2011", "venue": "ICDM '11 Proceedings of the 2011 IEEE 11th International Conference on Data Mining", "citations": ["5390bae520f70186a0f3bd6d", "558b34a2612c41e6b9d469a7"], "references": [], "authors": ["Nan Cao", "David Gotz", "Jimeng Sun", "Yu-Ru Lin", "Huamin Qu"], "_id": {"$oid": "5797a8cdc60b4bee2df450d2"}}, {"index": "5390b86b20f70186a0f2a402", "title": "Proceedings of the 5th International Symposium on Visual Information Communication and Interaction", "abstract": "Welcome to the International Symposium on Visual Information Communication and Interaction 2012 (VINCI 2012) held at Zhejiang University in Hangzhou, China, from September 27th to 28th, 2012. The objective of this symposium series is to provide a forum for researchers, artists, designers, and industrial practitioners to discuss the state of the art in visual communication theories, designs, and applications. As in past years, the papers in these proceedings represent the most interesting and exciting recent research in the area of visual communication. The conference received 27 paper submissions from the international research community, each of which was carefully reviewed by three Program Committee members. Based on these reviews, we accepted eleven full papers. In addition, because of the high quality of submissions, we selected a further five to be presented as short papers. The 16 papers presented here cover a broad range of visual communication topics, ranging from visualization, to designs, theories and applications.", "year": "2012", "venue": "The International Symposium on Visual Information Communication and Interaction", "citations": [], "references": [], "authors": ["Huamin Qu", "Wei Chen", "Philip T. Cox", "Shixia Liu"], "_id": {"$oid": "5797a690c60b4bee2dd8f6eb"}}, {"index": "558cad340cf2a44995718c62", "title": "Whisper: Tracing the Spatiotemporal Process of Information Diffusion in Real Time", "abstract": "When and where is an idea dispersed? Social media, like Twitter, has been increasingly used for exchanging information, opinions and emotions about events that are happening across the world. Here we propose a novel visualization design, “Whisper”, for tracing the process of information diffusion in social media in real time. Our design highlights three major characteristics of diffusion processes in social media: the temporal trend, social-spatial extent, and community response of a topic of interest. Such social, spatiotemporal processes are conveyed based on a sunflower metaphor whose seeds are often dispersed far away. In Whisper, we summarize the collective responses of communities on a given topic based on how tweets were retweeted by groups of users, through representing the sentiments extracted from the tweets, and tracing the pathways of retweets on a spatial hierarchical layout. We use an efficient flux line-drawing algorithm to trace multiple pathways so the temporal and spatial patterns can be identified even for a bursty event. A focused diffusion series highlights key roles such as opinion leaders in the diffusion process. We demonstrate how our design facilitates the understanding of when and where a piece of information is dispersed and what are the social responses of the crowd, for large-scale events including political campaigns and natural disasters. Initial feedback from domain experts suggests promising use for today’s information consumption and dispersion in the wild.", "year": "2012", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["554111250cf2adbd8385c427"], "references": [], "authors": ["Nan Cao", "Yu-Ru Lin", "Xiaohua Sun", "David Lazer", "Shixia Liu", "Huamin Qu"], "_id": {"$oid": "5797a6e6c60b4bee2ddceb66"}}, {"index": "5390b29820f70186a0ee9513", "title": "Introduction to the Special Section on Intelligent Visual Interfaces for Text Analysis", "abstract": "", "year": "2012", "venue": "ACM Transactions on Intelligent Systems and Technology (TIST)", "citations": [], "references": ["5390995c20f70186a0e14198", "5390995d20f70186a0e15df4", "5390a25820f70186a0e6039b", "5390a28020f70186a0e62bae", "5390a6d920f70186a0e87dcd", "539087c720f70186a0d56fed", "5390aeba20f70186a0ecb004", "539087d420f70186a0d5df85", "5390881720f70186a0d80beb", "53908a4020f70186a0d9dbb2", "53908cde20f70186a0dcd851"], "authors": ["Shixia Liu", "Michelle X. Zhou", "Giuseppe Carenini", "Huamin Qu"], "_id": {"$oid": "5797a710c60b4bee2ddebf6c"}}, {"index": "5390b29820f70186a0ee9514", "title": "Watch the Story Unfold with TextWheel: Visualization of Large-Scale News Streams", "abstract": "Keyword-based searching and clustering of news articles have been widely used for news analysis. However, news articles usually have other attributes such as source, author, date and time, length, and sentiment which should be taken into account. In addition, news articles and keywords have complicated macro/micro relations, which include relations between news articles (i.e., macro relation), relations between keywords (i.e., micro relation), and relations between news articles and keywords (i.e., macro-micro relation). These macro/micro relations are time varying and pose special challenges for news analysis. In this article we present a visual analytics system for news streams which can bring multiple attributes of the news articles and the macro/micro relations between news streams and keywords into one coherent analytical context, all the while conveying the dynamic natures of news streams. We introduce a new visualization primitive called TextWheel which consists of one or multiple keyword wheels, a document transportation belt, and a dynamic system which connects the wheels and belt. By observing the TextWheel and its content changes, some interesting patterns can be detected. We use our system to analyze several news corpora related to some major companies and the results demonstrate the high potential of our method.", "year": "2012", "venue": "ACM Transactions on Intelligent Systems and Technology (TIST)", "citations": ["558b34a2612c41e6b9d469a7"], "references": ["5390979920f70186a0e010cb", "5390980720f70186a0e0219b", "5390985d20f70186a0e079cd", "5390985d20f70186a0e08279", "5390990f20f70186a0e10032", "539099a220f70186a0e18ca4", "53909f8c20f70186a0e3f782", "5390a25820f70186a0e6039b", "5390a28020f70186a0e62baf", "5390a28020f70186a0e62bae", "5390a6d920f70186a0e87dd0", "5390a9a420f70186a0ea49bb", "5390aeba20f70186a0ecaff6", "539087c720f70186a0d588d5", "539087f820f70186a0d72df3", "5390882420f70186a0d88847", "53908cde20f70186a0dcd89e", "53908cde20f70186a0dcd897", "5390b48420f70186a0efcbab"], "authors": ["Weiwei Cui", "Huamin Qu", "Hong Zhou", "Wenbin Zhang", "Steve Skiena"], "_id": {"$oid": "5797a710c60b4bee2ddebf6d"}}, {"index": "5390b36120f70186a0ef0bb7", "title": "Visualization Applications and Design Studies", "abstract": "This article introduces the articles in the special issue on visualization applications and design studies. The articles cover both traditional application domains such as visualization of scientific simulations and emerging ones such as visualization of text streams, image collections, trajectories, and political phenomena.", "year": "2012", "venue": "IEEE Computer Graphics and Applications", "citations": [], "references": [], "authors": ["Giuseppe Di Battista", "Jean-Daniel Fekete", "Huamin Qu"], "_id": {"$oid": "5797a7f7c60b4bee2de92d15"}}, {"index": "5390b72e20f70186a0f22795", "title": "Guest Editor's Introduction: Special Section on the IEEE Pacific Visualization Symposium", "abstract": "", "year": "2012", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": [], "references": [], "authors": ["Giuseppe Di Battista", "Jean-Daniel Fekete", "Huamin Qu"], "_id": {"$oid": "5797a84dc60b4bee2ded992f"}}, {"index": "558feab8612c29c89cd7c34d", "title": "A message from the program chairs", "abstract": "Welcome to the proceedings of the Pacific Visualization Symposium 2012 (PacificVis 2012) at CEWIT Korea in Songdo, Korea, from February 28th to March 2nd, 2012. After a series of successful events in Kyoto (2008), Beijing (2009), Taipei (2010), and Hong Kong (2011), this meeting in Songdo is the fifth Pacific Visualization Symposium sponsored by the IEEE Computer Society Visualization and Graphics Technical Committee (VGTC). The objective of this symposium series is to foster greater exchange between visualization researchers and practitioners, with a focus on the Asia-Pacific region.", "year": "2012", "venue": "PACIFICVIS '12 Proceedings of the 2012 IEEE Pacific Visualization Symposium", "citations": [], "references": [], "authors": ["Helwig Hauser", "Stephen Kobourov", "Huamin Qu"], "_id": {"$oid": "5797a872c60b4bee2def938b"}}, {"index": "558c1e610cf2e30013db5768", "title": "RankExplorer: Visualization of Ranking Changes in Large Time Series Data", "abstract": "For many applications involving time series data, people are often interested in the changes of item values over time as well as their ranking changes. For example, people search many words via search engines like Google and Bing every day. Analysts are interested in both the absolute searching number for each word as well as their relative rankings. Both sets of statistics may change over time. For very large time series data with thousands of items, how to visually present ranking changes is an interesting challenge. In this paper, we propose RankExplorer, a novel visualization method based on ThemeRiver to reveal the ranking changes. Our method consists of four major components: 1) a segmentation method which partitions a large set of time series curves into a manageable number of ranking categories; 2) an extended ThemeRiver view with embedded color bars and changing glyphs to show the evolution of aggregation values related to each ranking category over time as well as the content changes in each ranking category; 3) a trend curve to show the degree of ranking changes over time; 4) rich user interactions to support interactive exploration of ranking changes. We have applied our method to some real time series data and the case studies demonstrate that our method can reveal the underlying patterns related to ranking changes which might otherwise be obscured in traditional visualizations.", "year": "2012", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": [], "references": [], "authors": ["Conglei Shi", "Weiwei Cui", "Shixia Liu", "Panpan Xu", "Wei Chen", "Huamin Qu"], "_id": {"$oid": "5797a898c60b4bee2df1ab32"}}, {"index": "558bd9d60cf2e30013db1f8c", "title": "VAIT: A Visual Analytics System for Metropolitan Transportation", "abstract": "With the increasing availability of metropolitan transportation data, such as those from vehicle Global Positioning Systems (GPSs) and road-side sensors, it has become viable for authorities, operators, and individuals to analyze the data for better understanding of the transportation system and, possibly, improved utilization and planning of the system. We report our experience in building the Visual Analytics for Intelligent Transportation (VAIT) system, which is the first system on real-life large-scale data sets for intelligent transportation. Our key observation is that metropolitan transportation data are inherently visual as they are spatio-temporal around road networks. Therefore, we visualize and manage traffic data, together with digital maps, and support analytical queries through this interactive visual interface. As a case study, we demonstrate VAIT on real-world taxi GPS and meter data sets from 15 000 taxis running for two months in a Chinese city of over 10 million people. We discuss the technical challenges in data calibration, storage, visualization, and query processing and offer first-hand lessons learned from developing the system. Based on our extensive empirical experiment results, VAIT beats state-of-the-art methods and systems in terms of scalability, efficiency, and effectiveness and offers us an easy-to-use, efficient, and scalable platform to shed more light on intelligent transportation research.", "year": "2013", "venue": "IEEE Transactions on Intelligent Transportation Systems", "citations": [], "references": [], "authors": ["Siyuan Liu", "Jiansu Pu", "Qiong Luo", "Huamin Qu", "Lionel M. Ni", "Ramayya Krishnan"], "_id": {"$oid": "5797a71fc60b4bee2ddf645f"}}, {"index": "5390bb1d20f70186a0f3e0ea", "title": "Visual analysis of retweeting propagation network in a microblogging platform", "abstract": "As a novel type of real-time social networking service, microblogging has already become ubiquitous and an irreplaceable tool. Tracking in the pulse of retweeting propagation is important and meaningful. In this paper, we investigate how information propagation in a specific microblogging platform evolves to identify relevant patterns and understand dynamic attributes of information propagation and the underlying sociological motivations. More specifically, based on the node-link diagram, we propose three efficient strategies to map the multiple attributes of information propagation graph to appropriate visual elements. For revealing the dynamic attributes, we propose two models: the depth-varying and the time-varying parallel data model to illustrate the temporal evolution efficiently. We also present a novel method by combining the traditional scatter plot with Hough transformation to represent the distribution of propagation instances and trace the propagation speeds. We integrate our methods to a visual mining tool and develop several interactive features. We demonstrate how our approaches improve the understanding of the propagation graph from a visual perspective by employing propagation datasets collected from Sina Weibo, the largest microblogging service provider in mainland China. Meanwhile, this visual mining tool has been evaluated by data analysts and successfully used in Sina Corporation as a helpful assistant to them.", "year": "2013", "venue": "Proceedings of the 6th International Symposium on Visual Information Communication and Interaction", "citations": [], "references": ["5390a06e20f70186a0e4bbf8", "539087aa20f70186a0d4aa2a", "5390a74f20f70186a0e8b80f", "5390a93b20f70186a0ea09ff", "5390a9a420f70186a0ea494d", "5390a96f20f70186a0ea486f", "5390af8820f70186a0ececd8", "5390b20120f70186a0ee504c", "5390b3ae20f70186a0ef3afb", "5390878e20f70186a0d3a411", "53908b0320f70186a0db2806", "5390958a20f70186a0def693"], "authors": ["Quan Li", "Huamin Qu", "Li Chen", "Robert Wang", "Junhai Yong", "Detan Si"], "_id": {"$oid": "5797a72cc60b4bee2ddffa8d"}}, {"index": "5390bfa220f70186a0f54bf6", "title": "Visual analysis of set relations in a graph", "abstract": "Many applications can be modeled as a graph with additional attributes attached to the nodes. For example, a graph can be used to model the relationship of people in a social media website or a bibliographical dataset. Meanwhile, additional information is often available, such as the topics people are interested in and the music they listen to. Based on this additional information, different set relationships may exist among people. Revealing the set relationships in a network can help people gain social insight and better understand their roles within a community. In this paper, we present a visualization system for exploring set relations in a graph. Our system is designed to reveal three different relationships simultaneously: the social relationship of people, the set relationship among people's items of interest, and the similarity relationship of the items. We propose two novel visualization designs: a) a glyph-based visualization to reveal people's set relationships in the context of their social networks; b) an integration of visual links and a contour map to show people and their items of interest which are clustered into different groups. The effectiveness of the designs has been demonstrated by the case studies on two representative datasets including one from a social music service website and another from an academic collaboration network.", "year": "2013", "venue": "EuroVis '13 Proceedings of the 15th Eurographics Conference on Visualization", "citations": [], "references": ["5390995c20f70186a0e14183", "53909a0220f70186a0e1f07e", "53909a9320f70186a0e21ad7", "5390a01420f70186a0e482ad", "5390a30b20f70186a0e6969e", "5390a6d920f70186a0e87dbd", "5390ada620f70186a0ec24bc", "5390ada620f70186a0ec24c6", "5390adfc20f70186a0ec4431", "5390afca20f70186a0ed3bbe", "5390b19020f70186a0edfb92", "5390b20120f70186a0ee5043", "5390b20120f70186a0ee5042", "5390b56a20f70186a0f04e6f", "5390b5ed20f70186a0f0c343", "5390b64020f70186a0f1a103", "5390b95520f70186a0f2f746", "5390b95520f70186a0f2f78c", "53908b2a20f70186a0db9f7a", "539087fe20f70186a0d74b5e"], "authors": ["Panpan Xu", "Fan Du", "Nan Cao", "Conglei Shi", "Hong Zhou", "Huamin Qu"], "_id": {"$oid": "5797a72dc60b4bee2de00cdc"}}, {"index": "5390bb7b20f70186a0f3f6b3", "title": "Guest Editors' Introduction: Special Section on the IEEE Pacific Visualization Symposium 2012", "abstract": "The papers in this special section are extended versions of three selected papers from the IEEE Pacific Visualization Symposium 2012 (PacificVis) which took place in Songdo, Korea from 28 February to 2 March 2012.", "year": "2013", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": [], "references": [], "authors": ["Helwig Hauser", "Stephen Kobourov", "Huamin Qu"], "_id": {"$oid": "5797a743c60b4bee2de11ce5"}}, {"index": "5390bb7b20f70186a0f41960", "title": "T-Watcher: A New Visual Analytic System for Effective Traffic Surveillance", "abstract": "Nowadays, big cities are suffering from severe traffic congestion as a result of the continuing increase in vehicles. Taxis equipped with GPS can be viewed as sensors of the traffic situation in city. However, trajectory data generated by taxi's GPS traces are often high-dimensional and contain large spatial and temporal attributes, which pose challenges for analysts. In this paper, based on taxi trajectory data, we present an interactive visual analytics system, T-Watcher, for monitoring and analyzing complex traffic situations in big cities. Users are able to use a carefully designed interface to monitor and inspect data interactively from three levels (region, road and vehicle views). We develop a visualization method to monitor and analyze traffic patterns for abnormal behaviors detection. In the region view of our system, global temporal changes in spatial evolution will be presented to users and can be interactively explored. The road view shows temporal changes to the traffic situations of significant segments of roads. The vehicle view uses a novel visualization method to track individual vehicles. Furthermore, the three views integrate important statistical and historical information related to traffic, which illustrate temporal changes of the traffic. We find that this design can help users explore historical information while monitoring traffic. We test our system on a real-life vehicle dataset collected from thousands of taxis and obtained some interesting findings. The experimental results confirm the effectiveness and efficiency of the proposed visual detection method. The analysis of the results also shows that our system is capable of effectively monitoring traffic and detecting abnormal traffic patterns.", "year": "2013", "venue": "MDM '13 Proceedings of the 2013 IEEE 14th International Conference on Mobile Data Management - Volume 01", "citations": [], "references": [], "authors": ["Jiansu Pu", "Siyuan Liu", "Ye Ding", "Huamin Qu", "Lionel Ni"], "_id": {"$oid": "5797a817c60b4bee2deae6f7"}}, {"index": "5390bfa220f70186a0f54c0b", "title": "Visualizing interchange patterns in massive movement data", "abstract": "Massive amount of movement data, such as daily trips made by millions of passengers in a city, are widely available nowadays. They are a highly valuable means not only for unveiling human mobility patterns, but also for assisting transportation planning, in particular for metropolises around the world. In this paper, we focus on a novel aspect of visualizing and analyzing massive movement data, i.e., the interchange pattern, aiming at revealing passenger redistribution in a traffic network. We first formulate a new model of circos figure, namely the interchange circos diagram, to present interchange patterns at a junction node in a bundled fashion, and optimize the color assignments to respect the connections within and between junction nodes. Based on this, we develop a family of visual analysis techniques to help users interactively study interchange patterns in a spatiotemporal manner: 1) multi-spatial scales: from network junctions such as train stations to people flow across and between larger spatial areas; and 2) temporal changes of patterns from different times of the day. Our techniques have been applied to real movement data consisting of hundred thousands of trips, and we present also two case studies on how transportation experts worked with our interface.", "year": "2013", "venue": "EuroVis '13 Proceedings of the 15th Eurographics Conference on Visualization", "citations": [], "references": ["5390979920f70186a0e010be", "53909eef20f70186a0e35f35", "53909f2c20f70186a0e379a8", "53909f2d20f70186a0e39509", "53909f8c20f70186a0e3f77f", "5390a5b020f70186a0e7de59", "5390a5b020f70186a0e7de58", "5390a5b020f70186a0e7de54", "5390a6d920f70186a0e87db8", "5390a6d920f70186a0e87dbe", "5390a6d920f70186a0e87dc1", "5390a6d920f70186a0e87d9f", "5390adfc20f70186a0ec442c", "5390adfc20f70186a0ec5059", "5390b0ca20f70186a0ed995a", "5390b0ca20f70186a0ed995c", "5390b20120f70186a0ee5075", "5390b20120f70186a0ee5048", "5390b4da20f70186a0f00af7", "5390b95520f70186a0f2f78b", "53908bad20f70186a0dc2d3a", "5390893e20f70186a0d940db", "539089bb20f70186a0d98fc5"], "authors": ["Wei Zeng", "Chi-Wing Fu", "Stefan Müller Arisona", "Huamin Qu"], "_id": {"$oid": "5797a88cc60b4bee2df0fca8"}}, {"index": "5390be6620f70186a0f4bbf2", "title": "Visual Analysis of Topic Competition on Social Media", "abstract": "How do various topics compete for public attention when they are spreading on social media? What roles do opinion leaders play in the rise and fall of competitiveness of various topics? In this study, we propose an expanded topic competition model to characterize the competition for public attention on multiple topics promoted by various opinion leaders on social media. To allow an intuitive understanding of the estimated measures, we present a timeline visualization through a metaphoric interpretation of the results. The visual design features both topical and social aspects of the information diffusion process by compositing ThemeRiver with storyline style visualization. ThemeRiver shows the increase and decrease of competitiveness of each topic. Opinion leaders are drawn as threads that converge or diverge with regard to their roles in influencing the public agenda change over time. To validate the effectiveness of the visual analysis techniques, we report the insights gained on two collections of Tweets: the 2012 United States presidential election and the Occupy Wall Street movement.", "year": "2013", "venue": "IEEE Transactions on Visualization and Computer Graphics", "citations": ["558af7e3612c41e6b9d3ef5a"], "references": [], "authors": ["Panpan Xu", "Yingcai Wu", "Enxun Wei", "Tai-Quan Peng", "Shixia Liu", "Jonathan J. H. Zhu", "Huamin Qu"], "_id": {"$oid": "5797a89dc60b4bee2df1e8a8"}}, {"index": "5390bded20f70186a0f49c6f", "title": "Big-Data Visualization", "abstract": "Almost all fields of study and practice sooner or later will confront the big-data problem. Visualization has proven effective for not only presenting essential information in vast amounts of data but also driving complex analyses. Big-data analytics and discovery present new research opportunities to the computer graphics and visualization community. This special issue highlights the latest advancements in solving the big-data problem through visual means, with four articles on new techniques, systems, or applications.", "year": "2013", "venue": "IEEE Computer Graphics and Applications", "citations": ["558bd4db0cf25dbdbb04dfff"], "references": [], "authors": ["Daniel Keim", "Huamin Qu", "Kwan-Liu Ma"], "_id": {"$oid": "5797a8dbc60b4bee2df50853"}}, {"index": "5536867c0cf2dbb77a816966", "title": "An AADL Model-Based Safety Analysis Method for Flight Control Software", "abstract": "This paper proposes a model-based software safety analysis method for flight control software. Firstly, the AADL architecture model and error model of flight control software are constructed separately. Then we convert the AADL model of flight control software into extended Markov chain model. We can evaluate safety of software component by calculate the probability of component state in different hazardous levels with the extended Markov chain model. Finally, safety of entire flight control software system can be calculated according to AADL error states composition relation, which can avoid states explosion problem of Markov chain model.", "year": "2014", "venue": "CICN '14 Proceedings of the 2014 International Conference on Computational Intelligence and Communication Networks", "citations": [], "references": [], "authors": ["Tao Zhang", "Yechun Jiang", "Junda Ye", "Cheng Jing", "Huamin Qu"], "_id": {"$oid": "5797a6e7c60b4bee2ddcf596"}}, {"index": "558b2da2612c41e6b9d45c94", "title": "Parallel Coordinates with Data Labels", "abstract": "Parallel coordinates have been widely used to analyze high-dimensional data. Numerous methods have been designed to provide overview patterns in parallel coordinate plots. However, detailed information is also important in data analysis. When several lines overlap or are close to one another, distinguishing detailed information of polyline crossings is difficult. In this paper, we present a novel approach to address the problem of polyline crossing ambiguity by using data labels. We place different labels along various polylines to give cues for differentiation of lines. We bend the lines and optimize the arrangement of curved lines to provide space for clear visible labels. An energy system that models attractive and repulsive forces of lines is used to guide the search for optimized line arrangement. The experiments on several real datasets demonstrate the effectiveness of our approach.", "year": "2014", "venue": "Proceedings of the 7th International Symposium on Visual Information Communication and Interaction", "citations": [], "references": ["5390979920f70186a0e010c6", "539087cf20f70186a0d5b66d", "539087f820f70186a0d72a2c", "5390b20120f70186a0ee507f", "5390956e20f70186a0ded95e", "53908cde20f70186a0dcd8d8", "5390b95520f70186a0f2f78e", "5390b95520f70186a0f2f73f", "5390b95520f70186a0f2f737", "5390990f20f70186a0e10037", "53908b0320f70186a0db246a", "5390a28020f70186a0e62bb0", "5390b95520f70186a0f2f736", "53909a9320f70186a0e21aa5", "5390b95520f70186a0f2f72e", "5390b63320f70186a0f17bdc", "53909ee020f70186a0e32fb5", "5390b20120f70186a0ee5081", "53908b0320f70186a0db251a", "539096cb20f70186a0df6aa0", "5390990f20f70186a0e10030", "5390a6d920f70186a0e87dbc", "5390b95520f70186a0f2f738"], "authors": ["Hong Zhou", "Panpan Xu", "Zhong Ming", "Huamin Qu"], "_id": {"$oid": "5797a70cc60b4bee2dde8b5a"}}, {"index": "5390c04520f70186a0f56308", "title": "Embedding Temporal Display into Maps for Occlusion-Free Visualization of Spatio-temporal Data", "abstract": "It is often necessary to analyze spatio-temporal data such as traffic flow, air pollution, and vehicle trajectories in a city. A map is often used to show the spatial context while various temporal displays like time series plots can be used to present the changes in the data over time. In this paper, we present a novel visualization that can seamlessly embed temporal displays into a map for occlusion-free visualization of both the spatial and temporal attributes of the data. We first extend the seam carving algorithm to broaden the roads of interest in a map with the least distortion to other areas, and then embed temporal displays into the roads to reveal temporal patterns without the occlusion of map information. We study various design choices in our method, including the encoding of the time direction and temporal display, and conduct two comprehensive user studies to validate our design decisions. We also demonstrate the usability of our approach with case studies on real traffic flow data in a major city.", "year": "2014", "venue": "PACIFICVIS '14 Proceedings of the 2014 IEEE Pacific Visualization Symposium", "citations": [], "references": [], "authors": ["Guodao Sun", "Yang Liu", "Wenbin Wu", "Ronghua Liang", "Huamin Qu"], "_id": {"$oid": "5797a834c60b4bee2dec60df"}}, {"index": "5390bf1320f70186a0f50b65", "title": "CAD/Graphics 2013: An image-space energy-saving visualization scheme for OLED displays", "abstract": "Current energy-saving color design approaches can be classified into two categories, namely, context-aware dimming and color remapping. The former darkens individual regions with respect to the user interactions, and the latter replaces the color set with a new color set that yields lower energy consumption. Both schemes have drawbacks: color dimming tends to cause loss of perceptual quality, and color remapping is an offline color design process. This paper introduces a novel saliency-guided color dimming scheme for OLED displays in both the context of 3D visualization and 2D visualization. The key idea is to eliminate undesired details while enhancing the visually salient features of each frame on-the-fly by leveraging the color and spatial information. A parallelizable image-space salient region detection algorithm is introduced to make the entire process GPU-friendly and real-time. We apply our approach on several representative visualization scenarios and conduct a preliminary user study. Experimental results demonstrate the effectiveness, efficiency, and quality of our approach.", "year": "2014", "venue": "Computers and Graphics", "citations": [], "references": ["5390975920f70186a0dfd5fb", "5390975920f70186a0dfe351", "5390979920f70186a0dffce4", "539098dc20f70186a0e0ddfe", "539099a220f70186a0e17ed5", "539099ed20f70186a0e1e49f", "53909ee020f70186a0e32af1", "53909f2d20f70186a0e3877d", "5390a4cc20f70186a0e750ec", "5390b00c20f70186a0ed6458", "5390b0ca20f70186a0edb6ac", "5390b60d20f70186a0f1127a", "5390b72e20f70186a0f227d1", "5390881d20f70186a0d822f0", "5390882d20f70186a0d8debe", "5390893e20f70186a0d92805", "53908d6520f70186a0dd1616", "5390956e20f70186a0ded7b2"], "authors": ["Haidong Chen", "Ji Wang", "Weifeng Chen", "Huamin Qu", "Wei Chen"], "_id": {"$oid": "5797a87ac60b4bee2df001cb"}}, {"index": "554111230cf2adbd8385c3ea", "title": "Visualization of bipartite relations between graphs and sets", "abstract": "", "year": "2015", "venue": "Journal of Visualization", "citations": [], "references": [], "authors": ["Hong Zhou", "Panpan Xu", "Huamin Qu"], "_id": {"$oid": "5797a73ac60b4bee2de0a57e"}}]